In [2]:
#i have created a new environment called my_data_env 
#and installed python 3.10,numpy 1.26.4, pandas 2.1.4
#and i will keep installing new libraries to this environment

In [3]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Pandas:

Pandas has data structures for data analysis, the most used are **series** and **dataframe**
1. **series**:is 1 dimensional array, only 1 column.
2. **dataframe**:is 2 dimensional, it consists of rows and columns.

**Note**:any operation or method used on a series or a dataframe, it does not modify the original series or dataframe , it returns a modified copy, if you want your method to adjust the original series or dataframe use inplace=True

## Series Datastructure:

In [4]:
#to make a series syntax series_name=pd.Series(iterable)
obj=pd.Series([1,"John",3.5,"Hey"])
print(obj)
#it creates a series and index each element starting from index 0 to n-1

0       1
1    John
2     3.5
3     Hey
dtype: object

In [5]:
# accessing an element using its index
obj[1]

'John'

In [6]:
#to get all values of the series
obj.values

array([1, 'John', 3.5, 'Hey'], dtype=object)

In [7]:
#you can decide the indeces names yourself
obj2=pd.Series([1,"John",3.5,"Hey"],index=["a","b","c","d"])
obj2

a       1
b    John
c     3.5
d     Hey
dtype: object

In [8]:
obj2['b']

'John'

In [9]:
#to get all indeces
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
#you can make a dictionary and pass it to pd.Series(dict), it will convert it to a series
#where keys of dict are indeces of the series
score={"Karim":90,"Mohamed":100,"Abbas":60,"Reda":40,"Hamaky":75}
scores=pd.Series(score)
scores

Karim       90
Mohamed    100
Abbas       60
Reda        40
Hamaky      75
dtype: int64

In [11]:
scores["Mohamed"]

100

In [12]:
#to get eleents based on a condition
scores[scores>=80]

Karim       90
Mohamed    100
dtype: int64

In [13]:
#to modify an element by indexing
scores["Reda"]=82
scores

Karim       90
Mohamed    100
Abbas       60
Reda        82
Hamaky      75
dtype: int64

In [14]:
#to modify elements based on a condition
scores[scores<=82]=80
scores

Karim       90
Mohamed    100
Abbas       80
Reda        80
Hamaky      80
dtype: int64

In [15]:
#membership operator
"Karim" in scores

True

In [16]:
"Ahmed" in scores

False

In [17]:
# you can perfor mathematical opertions on series elements
scores/10 #this line will divide all elements of scores by 10, but it won't change
#the series values

Karim       9.0
Mohamed    10.0
Abbas       8.0
Reda        8.0
Hamaky      8.0
dtype: float64

In [18]:
scores

Karim       90
Mohamed    100
Abbas       80
Reda        80
Hamaky      80
dtype: int64

In [19]:
scores**2

Karim       8100
Mohamed    10000
Abbas       6400
Reda        6400
Hamaky      6400
dtype: int64

In [20]:
scores.isnull() #will check if there is null element it will return true in its place
#otherwise it returns false

Karim      False
Mohamed    False
Abbas      False
Reda       False
Hamaky     False
dtype: bool

In [21]:
#to read a csv file 
#syntax: obj=pd.read_csv(r file_path)
sales=pd.read_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\vgsalesGlobale.csv")

In [22]:
sales.head() #returns the first 5 rows in a dataframe
#syntax: dataframe_name.head(n) by default n=5, n is the number of rows required

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [23]:
type(sales)

pandas.core.frame.DataFrame

In [24]:
sales.head(33)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31
10,11,Nintendogs,DS,2005.0,Simulation,Nintendo,9.07,11.00,1.93,2.75,24.76
11,12,Mario Kart DS,DS,2005.0,Racing,Nintendo,9.81,7.57,4.13,1.92,23.42
12,13,Pokemon Gold/Pokemon Silver,GB,1999.0,Role-Playing,Nintendo,9.00,6.18,7.20,0.71,23.10
13,14,Wii Fit,Wii,2007.0,Sports,Nintendo,8.94,8.03,3.60,2.15,22.72
14,15,Wii Fit Plus,Wii,2009.0,Sports,Nintendo,9.09,8.59,2.53,1.79,22.00
15,16,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
16,17,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
17,18,Grand Theft Auto: San Andreas,PS2,2004.0,Action,Take-Two Interactive,9.43,0.40,0.41,10.57,20.81
18,19,Super Mario World,SNES,1990.0,Platform,Nintendo,12.78,3.75,3.54,0.55,20.61
19,20,Brain Age: Train Your Brain in Minutes a Day,DS,2005.0,Misc,Nintendo,4.75,9.26,4.16,2.05,20.22
20,21,Pokemon Diamond/Pokemon Pearl,DS,2006.0,Role-Playing,Nintendo,6.42,4.52,6.04,1.37,18.36
21,22,Super Mario Land,GB,1989.0,Platform,Nintendo,10.83,2.71,4.18,0.42,18.14
22,23,Super Mario Bros. 3,NES,1988.0,Platform,Nintendo,9.54,3.44,3.84,0.46,17.28
23,24,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
24,25,Grand Theft Auto: Vice City,PS2,2002.0,Action,Take-Two Interactive,8.41,5.49,0.47,1.78,16.15
25,26,Pokemon Ruby/Pokemon Sapphire,GBA,2002.0,Role-Playing,Nintendo,6.06,3.90,5.38,0.50,15.85
26,27,Pokemon Black/Pokemon White,DS,2010.0,Role-Playing,Nintendo,5.57,3.28,5.65,0.82,15.32
27,28,Brain Age 2: More Training in Minutes a Day,DS,2005.0,Puzzle,Nintendo,3.44,5.36,5.32,1.18,15.30
28,29,Gran Turismo 3: A-Spec,PS2,2001.0,Racing,Sony Computer Entertainment,6.85,5.09,1.87,1.16,14.98
29,30,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
30,31,Pokémon Yellow: Special Pikachu Edition,GB,1998.0,Role-Playing,Nintendo,5.89,5.04,3.12,0.59,14.64
31,32,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
32,33,Pokemon X/Pokemon Y,3DS,2013.0,Role-Playing,Nintendo,5.17,4.05,4.34,0.79,14.35

In [25]:
#to get the datatype of each column dataframe.dtypes
sales.dtypes

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [26]:
#each column in a dataframe is considered a series
#to get all info of a series we use series_name.describe
obj2.describe()

count     4
unique    4
top       1
freq      1
dtype: int64

In [27]:
sales.Genre.describe()

count      16598
unique        12
top       Action
freq        3316
Name: Genre, dtype: object

In [28]:
#to know the number of occurence of each value in a series 
#series_name.value_counts()
sales.Genre.value_counts()
#Breakdown 
#sales.Genre picks the series(column) named Genre in the sales dataframe
#.value_counts() returns a series
#that contains the number of occurences of each value in the column
#adding (normalize=True) as a parameter will divide the number of occurence of each
#value by the total number of values to get a proportion

Genre
Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: count, dtype: int64

In [29]:
sales.Genre.value_counts(normalize=True)

Genre
Action          0.199783
Sports          0.141342
Misc            0.104772
Role-Playing    0.089649
Shooter         0.078925
Adventure       0.077479
Racing          0.075250
Platform        0.053380
Simulation      0.052235
Fighting        0.051090
Strategy        0.041029
Puzzle          0.035064
Name: proportion, dtype: float64

In [30]:
type(sales.Genre)

pandas.core.series.Series

In [31]:
type(sales.Genre.value_counts())

pandas.core.series.Series

In [32]:
#to return first 5 elements of a series
sales.Genre.head()

0          Sports
1        Platform
2          Racing
3          Sports
4    Role-Playing
Name: Genre, dtype: object

In [33]:
sales.Genre.value_counts().head()

Genre
Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Name: count, dtype: int64

In [34]:
#series_name.unique() returns an array of all unique values in a series
sales.Genre.unique()

array(['Sports', 'Platform', 'Racing', 'Role-Playing', 'Puzzle', 'Misc',
       'Shooter', 'Simulation', 'Action', 'Fighting', 'Adventure',
       'Strategy'], dtype=object)

In [35]:
#series_name.nunique() returns the number of unique values in a series
sales.Genre.nunique()

12

In [36]:
sales.Global_Sales.describe()

count    16598.000000
mean         0.537441
std          1.555028
min          0.010000
25%          0.060000
50%          0.170000
75%          0.470000
max         82.740000
Name: Global_Sales, dtype: float64

In [37]:
#to get the mean
sales.Global_Sales.mean()

0.5374406555006628

In [38]:
sales.Global_Sales.value_counts()

Global_Sales
0.02    1071
0.03     811
0.04     645
0.05     632
0.01     618
        ...
5.01       1
5.05       1
5.07       1
5.11       1
3.16       1
Name: count, Length: 623, dtype: int64

## DataFrame:

In [39]:
#a dataframe is a 2 dimensional datastructure
data={"Name":["Karim","Alaa","Seif","Mary","Martina","Adel","Dyasty"],
      "Score":[90,70,79,93,87,83,95],
      "Sport":["Football","Swimming","Taekondo","Tennis","Squash","Football","Wrestling"],
      "Sex":["M","F","M","F","F","M","M"]}

In [40]:
#to make a dataframe
#syntax data_frame_name=pd.DataFrame(data)
students=pd.DataFrame(data) #it makes a data frame and provide indeces fro 0 to n-1 for
#each row
students

      Name  Score      Sport Sex
0    Karim     90   Football   M
1     Alaa     70   Swimming   F
2     Seif     79   Taekondo   M
3     Mary     93     Tennis   F
4  Martina     87     Squash   F
5     Adel     83   Football   M
6   Dyasty     95  Wrestling   M

In [41]:
#to create a dataframe with required column arrangment
#data_frame_name=pd.DataFrame(data,columns=[your arrangemet in a list])
students_rearranged=pd.DataFrame(data,columns=["Name","Sport","Sex","Score"])
students_rearranged

      Name      Sport Sex  Score
0    Karim   Football   M     90
1     Alaa   Swimming   F     70
2     Seif   Taekondo   M     79
3     Mary     Tennis   F     93
4  Martina     Squash   F     87
5     Adel   Football   M     83
6   Dyasty  Wrestling   M     95

In [42]:
students.head()

      Name  Score     Sport Sex
0    Karim     90  Football   M
1     Alaa     70  Swimming   F
2     Seif     79  Taekondo   M
3     Mary     93    Tennis   F
4  Martina     87    Squash   F

In [43]:
students.tail()

      Name  Score      Sport Sex
2     Seif     79   Taekondo   M
3     Mary     93     Tennis   F
4  Martina     87     Squash   F
5     Adel     83   Football   M
6   Dyasty     95  Wrestling   M

In [44]:
students.tail(3)

      Name  Score      Sport Sex
4  Martina     87     Squash   F
5     Adel     83   Football   M
6   Dyasty     95  Wrestling   M

In [45]:
students.head(2)

    Name  Score     Sport Sex
0  Karim     90  Football   M
1   Alaa     70  Swimming   F

In [46]:
#to add columns to a dataframe
students=pd.DataFrame(data,columns=["Name","Sport","Gender","Score","Age"])
#this will arrange the columns in the given order, and the columns with no values 
#will take Null value
students

      Name      Sport Gender  Score  Age
0    Karim   Football    NaN     90  NaN
1     Alaa   Swimming    NaN     70  NaN
2     Seif   Taekondo    NaN     79  NaN
3     Mary     Tennis    NaN     93  NaN
4  Martina     Squash    NaN     87  NaN
5     Adel   Football    NaN     83  NaN
6   Dyasty  Wrestling    NaN     95  NaN

In [47]:
#to provide indeces names yourself
students=pd.DataFrame(data,columns=["Name","Sport","Gender","Score","Age"],
                     index=['One','Two','Three','Four','Five','Six','Seven',])
students

          Name      Sport Gender  Score  Age
One      Karim   Football    NaN     90  NaN
Two       Alaa   Swimming    NaN     70  NaN
Three     Seif   Taekondo    NaN     79  NaN
Four      Mary     Tennis    NaN     93  NaN
Five   Martina     Squash    NaN     87  NaN
Six       Adel   Football    NaN     83  NaN
Seven   Dyasty  Wrestling    NaN     95  NaN

In [48]:
students['Name'] #you can access columns but not rows by this method
#to acces rows based on lables we use loc

One        Karim
Two         Alaa
Three       Seif
Four        Mary
Five     Martina
Six         Adel
Seven     Dyasty
Name: Name, dtype: object

In [49]:
my_columns=["Name","Sport"]
students[my_columns]

          Name      Sport
One      Karim   Football
Two       Alaa   Swimming
Three     Seif   Taekondo
Four      Mary     Tennis
Five   Martina     Squash
Six       Adel   Football
Seven   Dyasty  Wrestling

# loc[]:
How df.loc[] Works:

loc is the primary method for accessing data by label. Its syntax is df.loc[row_labels, column_labels].

Selecting Rows: You can pass a single label, a list of labels, or a slice of labels.

df.loc['row_label']: Selects a single row.

df.loc[['row1', 'row2']]: Selects multiple rows.

df.loc['start_row':'end_row']: Selects a range of rows.

Selecting Columns: You can do the same with column labels.

df.loc[:, 'col_name']: Selects all rows and a single column.

df.loc[:, ['col1', 'col2']]: Selects all rows and multiple columns.

Selecting Both: You can combine row and column selections.

df.loc['row_label', 'col_name']: Selects a single cell.

df.loc[['r1', 'r2'], ['c1', 'c2']]: Selects a specific block of data.

loc is distinct from .iloc[], which is used for integer-based indexing.

In [50]:
students.loc["One"]

Name         Karim
Sport     Football
Gender         NaN
Score           90
Age            NaN
Name: One, dtype: object

In [51]:
students.loc[["One"]]

      Name     Sport Gender  Score  Age
One  Karim  Football    NaN     90  NaN

In [52]:
students.loc[["Three","Two"]]

       Name     Sport Gender  Score  Age
Three  Seif  Taekondo    NaN     79  NaN
Two    Alaa  Swimming    NaN     70  NaN

In [53]:
students.loc[:,["Name","Sport"]] #to get a whole column or 2

          Name      Sport
One      Karim   Football
Two       Alaa   Swimming
Three     Seif   Taekondo
Four      Mary     Tennis
Five   Martina     Squash
Six       Adel   Football
Seven   Dyasty  Wrestling

In [54]:
students.loc[["One","Three"],["Name","Gender"]] #to get speific rows and columns

        Name Gender
One    Karim    NaN
Three   Seif    NaN

In [55]:
students.loc["One":"Four","Name":"Gender"]

        Name     Sport Gender
One    Karim  Football    NaN
Two     Alaa  Swimming    NaN
Three   Seif  Taekondo    NaN
Four    Mary    Tennis    NaN

**iloc**: is a pandas DataFrame accessor used for integer-based indexing. It selects data based on the integer position of rows and columns, not their labels or names. It's similar to how you would slice a standard Python list or NumPy array.

How iloc Works
iloc stands for "integer location." Its syntax is df.iloc[row_index, column_index].

Row Selection:

df.iloc[0]: Selects the first row (at integer position 0).

df.iloc[[0, 2, 4]]: Selects the first, third, and fifth rows.

df.iloc[1:4]: Selects a slice of rows from the second to the fourth (the end index is exclusive).

Column Selection:

df.iloc[:, 0]: Selects all rows for the first column.

df.iloc[:, [0, 2]]: Selects all rows for the first and third columns.

Combined Selection:

df.iloc[1, 2]: Selects the element at the second row and third column.

df.iloc[0:2, 1:3]: Selects a block of data from the first two rows and the second and third columns.

In [56]:
students.iloc[1]

Name          Alaa
Sport     Swimming
Gender         NaN
Score           70
Age            NaN
Name: Two, dtype: object

In [57]:
students.iloc[[1]]

     Name     Sport Gender  Score  Age
Two  Alaa  Swimming    NaN     70  NaN

In [58]:
students.iloc[1:5,2:4]

      Gender  Score
Two      NaN     70
Three    NaN     79
Four     NaN     93
Five     NaN     87

In [59]:
age_values=[18,20,24,22,21,26,29]
students["Age"]=age_values #to assign values to a column
students

          Name      Sport Gender  Score  Age
One      Karim   Football    NaN     90   18
Two       Alaa   Swimming    NaN     70   20
Three     Seif   Taekondo    NaN     79   24
Four      Mary     Tennis    NaN     93   22
Five   Martina     Squash    NaN     87   21
Six       Adel   Football    NaN     83   26
Seven   Dyasty  Wrestling    NaN     95   29

In [60]:
#to add a column based on a condition
students["Pass"]=students.Score>=85
students

          Name      Sport Gender  Score  Age   Pass
One      Karim   Football    NaN     90   18   True
Two       Alaa   Swimming    NaN     70   20  False
Three     Seif   Taekondo    NaN     79   24  False
Four      Mary     Tennis    NaN     93   22   True
Five   Martina     Squash    NaN     87   21   True
Six       Adel   Football    NaN     83   26  False
Seven   Dyasty  Wrestling    NaN     95   29   True

In [61]:
#to delete a colum del df_name["column_name"]
del students["Pass"]
students

          Name      Sport Gender  Score  Age
One      Karim   Football    NaN     90   18
Two       Alaa   Swimming    NaN     70   20
Three     Seif   Taekondo    NaN     79   24
Four      Mary     Tennis    NaN     93   22
Five   Martina     Squash    NaN     87   21
Six       Adel   Football    NaN     83   26
Seven   Dyasty  Wrestling    NaN     95   29

In [62]:
students.T

             One       Two     Three    Four     Five       Six      Seven
Name       Karim      Alaa      Seif    Mary  Martina      Adel     Dyasty
Sport   Football  Swimming  Taekondo  Tennis   Squash  Football  Wrestling
Gender       NaN       NaN       NaN     NaN      NaN       NaN        NaN
Score         90        70        79      93       87        83         95
Age           18        20        24      22       21        26         29

In [63]:
scores_data={"Math":[85,70,60,40,99,90,93,85,86,89,87,84],
            "Physics":[80,72,67,47,79,80,83,95,76,79,97,94]}
scores=pd.DataFrame(scores_data,index=["Karim","Karam","Adel","Saher","Shaaban",
                                      "Moemen","Elmzayen","Shafey","Malek","Sara",
                                      "Salma","Sandy"])
scores.index.name="Names"#give the index column a name
scores.columns.name="Lessons"#gives the columns row a name
scores

Lessons   Math  Physics
Names
Karim       85       80
Karam       70       72
Adel        60       67
Saher       40       47
Shaaban     99       79
Moemen      90       80
Elmzayen    93       83
Shafey      85       95
Malek       86       76
Sara        89       79
Salma       87       97
Sandy       84       94

In [64]:
scores.values

array([[85, 80],
       [70, 72],
       [60, 67],
       [40, 47],
       [99, 79],
       [90, 80],
       [93, 83],
       [85, 95],
       [86, 76],
       [89, 79],
       [87, 97],
       [84, 94]], dtype=int64)

## some useful methods in pandas:

In [65]:
s=pd.Series([1,2,3,4],
            index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [66]:
#series_name.reindex([list of new indeces])
#the index that was there before will hold the same value, new indeces will hold null
s2=s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [67]:
s3=pd.Series(["blue","yellow","purple"],
             index=[0,2,4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [68]:
s3.reindex(range(6))

0      blue
1       NaN
2    yellow
3       NaN
4    purple
5       NaN
dtype: object

In [69]:
s3.reindex(range(6),method="ffill") #forward fill means null data will hold the value
#of the data before it

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [70]:
s3.reindex(range(6),method="bfill")#backward fill means null data will hold the value
#of the data after it

0      blue
1    yellow
2    yellow
3    purple
4    purple
5       NaN
dtype: object

In [71]:
df=pd.DataFrame(np.arange(9).reshape(3,3),
                index=["a","c","d"],
                columns=["Tim","Tom","Kate"])
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [72]:
df.reindex(["d","c","b","a"])

   Tim  Tom  Kate
d  6.0  7.0   8.0
c  3.0  4.0   5.0
b  NaN  NaN   NaN
a  0.0  1.0   2.0

In [73]:
df.reindex(columns=["Kate","Tim","Tom","Andrew"]) #reindexing based on columns

   Kate  Tim  Tom  Andrew
a     2    0    1     NaN
c     5    3    4     NaN
d     8    6    7     NaN

In [74]:
names=["Kate","Tim","Tom","Andrew"]
df.reindex(columns=names)

   Kate  Tim  Tom  Andrew
a     2    0    1     NaN
c     5    3    4     NaN
d     8    6    7     NaN

**drop method**:
The drop() method in pandas is used to remove specified rows or columns from a DataFrame or Series. It's a versatile function that allows you to delete data by label.

The method does not modify the original DataFrame in place by default. Instead, it returns a new DataFrame with the specified rows or columns removed.

How it Works
The drop() method has two main parameters that control its behavior: labels and axis.

labels: This is the label or list of labels (index names or column names) you want to remove.

axis: This parameter specifies whether you are dropping rows or columns.

axis=0 (or 'index') is the default and tells pandas to drop rows.

axis=1 (or 'columns') tells pandas to drop columns.

In [75]:
s=pd.Series(np.arange(5),index=["a","b","c","d","e"])
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [76]:
s.drop("a")

b    1
c    2
d    3
e    4
dtype: int32

In [77]:
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [78]:
s.drop(["a","e"],inplace=True)

In [79]:
s

b    1
c    2
d    3
dtype: int32

In [80]:
students

          Name      Sport Gender  Score  Age
One      Karim   Football    NaN     90   18
Two       Alaa   Swimming    NaN     70   20
Three     Seif   Taekondo    NaN     79   24
Four      Mary     Tennis    NaN     93   22
Five   Martina     Squash    NaN     87   21
Six       Adel   Football    NaN     83   26
Seven   Dyasty  Wrestling    NaN     95   29

In [81]:
students.drop(["One","Six"])

          Name      Sport Gender  Score  Age
Two       Alaa   Swimming    NaN     70   20
Three     Seif   Taekondo    NaN     79   24
Four      Mary     Tennis    NaN     93   22
Five   Martina     Squash    NaN     87   21
Seven   Dyasty  Wrestling    NaN     95   29

In [82]:
students.drop("Gender",axis=1)

          Name      Sport  Score  Age
One      Karim   Football     90   18
Two       Alaa   Swimming     70   20
Three     Seif   Taekondo     79   24
Four      Mary     Tennis     93   22
Five   Martina     Squash     87   21
Six       Adel   Football     83   26
Seven   Dyasty  Wrestling     95   29

## Arithmetic Operations in pandas:

In [83]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [84]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [85]:
s1+s2 #will see equal indeces in each series and sum the elements, if no matching indeces
# it will give null

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [86]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

In [87]:
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [88]:
df1+df2 #will see matching indeces and matching columns if an index with a column
#matches then it will sum elements if no match then null

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

**instead of + we can use add() method:**
The .add() method in pandas is used to add two DataFrames element-wise. It's a more flexible alternative to the standard + operator, especially when dealing with DataFrames that have different shapes or missing values.

The fill_value=0 argument is crucial here. It tells pandas to treat any missing values (NaN) in either df1 or df2 as 0 before performing the addition. This prevents the result from being NaN in places where only one of the DataFrames has a value.

In [89]:
df1.add(df2,fill_value=0)#only put Null if the element did not exist in both dataframes
#if it exists in 1 only it will keep it
#if it exists in  both it adds the two elements

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [90]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [91]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [92]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [93]:
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int32

In [94]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [95]:
df2-s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [96]:
s2=df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [97]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

The .sub() method in pandas is used for subtraction of one DataFrame or Series from another, performing the operation element-wise.

In the command df2.sub(s2, axis="index"), you are subtracting the Series s2 (which is a column from df2) from the entire DataFrame df2. The axis="index" argument is crucial because it tells pandas how to align the Series for subtraction.

How axis="index" Works
axis="index" (or axis=0) means to align the Series along the rows (the index). Pandas will broadcast the values of s2 across each row of df2.

Essentially, this operation will:

Take the first value of s2 and subtract it from every value in the first row of df2.

Take the second value of s2 and subtract it from every value in the second row of df2.

Continue this process for all rows.

If you had used axis="columns", the values of s2 would be subtracted from the corresponding columns of df2.

In [98]:
print(df2)
print(s2)
df2.sub(s2,axis='index')

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8
Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

## Applying a Function:

In [99]:
df=pd.DataFrame(np.random.randn(4,3),
               columns=list("ABC"),
                index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim   -2.172418  0.088010  0.867487
Susan  0.504145  0.229881 -0.362232
Tim    0.448098  0.108417 -0.975513
Tom    0.594359 -1.101719 -0.570808

In [100]:
np.abs(df)

              A         B         C
Kim    2.172418  0.088010  0.867487
Susan  0.504145  0.229881  0.362232
Tim    0.448098  0.108417  0.975513
Tom    0.594359  1.101719  0.570808

## the .apply() function:
The .apply() method in pandas is a versatile and powerful function used to apply a function along an axis of a DataFrame or to the elements of a Series. It's especially useful for operations that cannot be easily vectorized (i.e., performed on the entire array at once).

How it Works
The .apply() method passes each Series (if applying to columns) or each element (if applying to a Series) to a function and returns a new Series or DataFrame with the results.

Syntax: df.apply(func, axis=0, args=(), **kwargs)

func: The function you want to apply. This can be a built-in function, a lambda function, or a user-defined function.

axis: Specifies whether the function is applied row-wise or column-wise.

axis=0 (default): Applies the function to each column. The function will receive each column as a Series.

axis=1: Applies the function to each row. The function will receive each row as a Series.

In [101]:
f=lambda x:x.max()-x.min()

In [102]:
print(df)
df.apply(f) #df.apply(function) applies the function for each column of the dataframe
#it recieves each column as a series and performs the function on it 
#note that series is built with np arrays

              A         B         C
Kim   -2.172418  0.088010  0.867487
Susan  0.504145  0.229881 -0.362232
Tim    0.448098  0.108417 -0.975513
Tom    0.594359 -1.101719 -0.570808

A    2.766776
B    1.331600
C    1.843000
dtype: float64

In [103]:
df.apply(f,axis=1) #axis =1 makes it apply to each row in the dataframe
##\it recieves each row as a series and performs the function on it 
#note that series is built with np arrays
#so a function that works with np array work with a series or a dataframe

Kim      3.039905
Susan    0.866377
Tim      1.423611
Tom      1.696077
dtype: float64

In [104]:
def f(x):
    return x**2

In [105]:
print(df)
df.apply(f)

              A         B         C
Kim   -2.172418  0.088010  0.867487
Susan  0.504145  0.229881 -0.362232
Tim    0.448098  0.108417 -0.975513
Tom    0.594359 -1.101719 -0.570808

              A         B         C
Kim    4.719398  0.007746  0.752534
Susan  0.254162  0.052845  0.131212
Tim    0.200792  0.011754  0.951626
Tom    0.353262  1.213784  0.325822

## Sorting and ranking in Pandas:

In [106]:
s=pd.Series(range(5),
            index=["e","d","a","b","c"])
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

**.sort_index()**:
The .sort_index() method in pandas is used to sort a DataFrame or Series by its index labels. This is useful for reordering your data based on the row or column names, making it easier to read and work with.

How It Works
The method has several key parameters that control the sorting:

axis: Specifies whether to sort by row index (axis=0, the default) or column index (axis=1).

ascending: A boolean that determines the sort order. True (the default) sorts from lowest to highest, while False sorts from highest to lowest.

inplace: A boolean that, if True, modifies the original DataFrame directly. By default, it's False and returns a new, sorted DataFrame.

In [107]:
s.sort_index() #sorts the series ascendingly based on index

a    2
b    3
c    4
d    1
e    0
dtype: int64

In [108]:
s.sort_index(ascending=False)

e    0
d    1
c    4
b    3
a    2
dtype: int64

In [109]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=[2,1,3],
    columns=["d","a","b","c"])
df

   d  a   b   c
2  0  1   2   3
1  4  5   6   7
3  8  9  10  11

In [110]:
df.sort_index(axis=1)

   a   b   c  d
2  1   2   3  0
1  5   6   7  4
3  9  10  11  8

In [111]:
df.sort_index()

   d  a   b   c
1  4  5   6   7
2  0  1   2   3
3  8  9  10  11

df

In [112]:
df.sort_index(inplace=True)
df.sort_index(axis=1,inplace=True)
df

   a   b   c  d
1  5   6   7  4
2  1   2   3  0
3  9  10  11  8

**.sort_values()**:
The .sort_values() method in pandas is used to sort a DataFrame or Series by the values in one or more columns. It's the most common way to reorder your data based on its content, not its index.

How It Works
sort_values() is a very flexible method with several important parameters:

by: The label or list of labels (column names) by which to sort. This is a mandatory parameter.

axis: Specifies whether to sort by column values (axis=0, the default) or row values (axis=1). Sorting by row values is less common.

ascending: A boolean or list of booleans that determines the sort order. True (the default) sorts from lowest to highest, while False sorts from highest to lowest. If you're sorting by multiple columns, you can provide a list to specify a different order for each column.

inplace: A boolean that, if True, modifies the original DataFrame directly. By default, it's False.

In [113]:
s=pd.Series([90,85,95,78,92,87,78,79,66],
           index=list("ABCDEFGHI"))
s

A    90
B    85
C    95
D    78
E    92
F    87
G    78
H    79
I    66
dtype: int64

In [114]:
s.sort_values()

I    66
D    78
G    78
H    79
B    85
F    87
A    90
E    92
C    95
dtype: int64

In [115]:
s.sort_values(ascending=False)

C    95
E    92
A    90
F    87
B    85
H    79
D    78
G    78
I    66
dtype: int64

In [116]:
data = {'Name': ['Karim', 'Ziad', 'Adly', 'Ahmed'],
        'Score': [85, 92, 78, 92]}
df = pd.DataFrame(data)
df

    Name  Score
0  Karim     85
1   Ziad     92
2   Adly     78
3  Ahmed     92

In [117]:
#to sort by a single column in a dataframe
df.sort_values(by="Score",ascending=False)

    Name  Score
1   Ziad     92
3  Ahmed     92
0  Karim     85
2   Adly     78

In [118]:
#to sort by multiple columns
df.sort_values(by=["Score","Name"],ascending=[False,True])#will sort first
#by score descendingly then those who have same score will by sorted by name 
#ascendingly

    Name  Score
3  Ahmed     92
1   Ziad     92
0  Karim     85
2   Adly     78

## Computing Descriptive Statistics:

In [119]:
df=pd.DataFrame(
    [[2.4,np.nan],[6.3,-5.4],
     [np.nan,np.nan],[0.75,-1.3]],
    index=["a","b","c","d"],
    columns=["one","two"])
df

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [120]:
df.sum()

one    9.45
two   -6.70
dtype: float64

In [121]:
df.sum(axis=1)

a    2.40
b    0.90
c    0.00
d   -0.55
dtype: float64

In [122]:
df.mean()

one    3.15
two   -3.35
dtype: float64

In [123]:
df.mean(axis=1)

a    2.400
b    0.450
c      NaN
d   -0.275
dtype: float64

In [124]:
df.mean(axis=1,skipna=False) #skipna is default true, if it is set to false
#any Nan that appears while calculating the mean will result in na

a      NaN
b    0.450
c      NaN
d   -0.275
dtype: float64

In [125]:
df.sum(axis=1,skipna=False)

a     NaN
b    0.90
c     NaN
d   -0.55
dtype: float64

In [126]:
print(df)
df.idxmax() #returns the index of the greates element in each column

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

one    b
two    d
dtype: object

In [127]:
df.idxmin()#returns the index of the min value

one    d
two    b
dtype: object

In [128]:
df.max()

one    6.3
two   -1.3
dtype: float64

In [129]:
df.max(axis=1)

a    2.40
b    6.30
c     NaN
d    0.75
dtype: float64

In [130]:
df.min()

one    0.75
two   -5.40
dtype: float64

In [131]:
df.min(axis=1)

a    2.4
b   -5.4
c    NaN
d   -1.3
dtype: float64

In [132]:
print(df)
df.cumsum() #does cumulative sum

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

    one  two
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [133]:
df.describe()

         one       two
count  3.000  2.000000
mean   3.150 -3.350000
std    2.850  2.899138
min    0.750 -5.400000
25%    1.575 -4.375000
50%    2.400 -3.350000
75%    4.350 -2.325000
max    6.300 -1.300000

In [134]:
#now we will read a csv file and store it in a dataframe and do some analysis
iris=pd.read_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\iris.data",
                sep=",",
                header=None)
#sep ="," each element is seperated by a ,
#header=None the first line is not a header it is data
iris

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [135]:
iris.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [136]:
iris.tail()

       0    1    2    3               4
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [137]:
#to name the columns of a dataframe
iris.columns=['sepal_length','sepal_width',
             'petal_length','petal_width',
             'class']
iris.head()

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [138]:
#to calculate the correlation between two columns series_name.corr(series_name)
iris["sepal_length"].corr(iris["sepal_width"])

-0.10936924995064937

In [139]:
#to get a dataframe of correlations
iris.corr(numeric_only=True)

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.109369      0.871754     0.817954
sepal_width      -0.109369     1.000000     -0.420516    -0.356544
petal_length      0.871754    -0.420516      1.000000     0.962757
petal_width       0.817954    -0.356544      0.962757     1.000000

In [140]:
#to get a dataframe of correlations
iris.iloc[:,:].corr(numeric_only=True)

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.109369      0.871754     0.817954
sepal_width      -0.109369     1.000000     -0.420516    -0.356544
petal_length      0.871754    -0.420516      1.000000     0.962757
petal_width       0.817954    -0.356544      0.962757     1.000000

In [141]:
#to get a series of correlations with a certain column
iris.iloc[:,:].corrwith(iris["petal_length"],numeric_only=True)

sepal_length    0.871754
sepal_width    -0.420516
petal_length    1.000000
petal_width     0.962757
dtype: float64

## Data Reading & Writing in Pandas:

In [142]:
df=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data2.txt",
                )
df

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

In [143]:
df=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data2.txt",
                sep=",",
                header=None)
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

In [144]:
#to add column names:
df=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data2.txt",
                sep=",",
                header=None)
df.columns=["names","score","sex"]
df

  names  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F

In [145]:
#to add column names while reading data
df=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data2.txt",
                sep=",",
                header=None,
                names=["names","score","sex"])

df

  names  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F

In [146]:
# to identify a column to become indeces
df=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data2.txt",
                sep=",",
                header=None,
                names=["names","score","sex"],
                index_col="names")
    
df

       score sex
names
Tom       80   M
Tim       85   M
Kim       70   M
Kate      90   F
Alex      75   F

In [147]:
df2=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data3.txt",
                sep=",")
df2

  lesson  name  one  two
0   Math   Kim   80   85
1   Math   Tim   90   70
2   Math   Tom   70   95
3   Stat  Kate   65   90
4   Stat  Alex   85   80
5   Stat   Sam   55   70

In [148]:
#to make two indeces columns
df2=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data3.txt",
                sep=",",
                 index_col=["lesson","name"])
df2

             one  two
lesson name
Math   Kim    80   85
       Tim    90   70
       Tom    70   95
Stat   Kate   65   90
       Alex   85   80
       Sam    55   70

In [155]:
df2.loc["Math"]

      one  two
name
Kim    80   85
Tim    90   70
Tom    70   95

In [157]:
df2.loc["Stat"]

      one  two
name
Kate   65   90
Alex   85   80
Sam    55   70

In [158]:
df2.loc["Math","Tim"]

one    90
two    70
Name: (Math, Tim), dtype: int64

In [159]:
df3=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data4.txt",
                sep=",")
df3

                          #hello
name                score    sex
#scores of students NaN      NaN
Tim                 80         M
Kate                85         F
Alex                70         M
Tom                 90         M
Kim                 75         F

In [160]:
#to skip some rows while reading data :skiprows
df3=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data4.txt",
                sep=",",
                 skiprows=[0,2])
df3

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

In [161]:
#to select only some cols :usecols
df3=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data4.txt",
                sep=",",
                 skiprows=[0,2],
                 usecols=[0,1])
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70
3   Tom     90
4   Kim     75

In [162]:
#to take a certain number of rows :nrows
df3=pd.read_table(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data4.txt",
                sep=",",
                 skiprows=[0,2],
                 usecols=[0,1],
                 nrows=3)
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70

In [163]:
df=pd.read_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\data.txt",
                sep="\t")
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

## Writing Data:

In [164]:
df.to_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\my_new_data.csv")

In [165]:
df = pd.DataFrame({
    'name': ['Ali', 'Mona'],
    'age': [25, 30]
})
df

   name  age
0   Ali   25
1  Mona   30

In [166]:
df.to_json(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\my_new_json.json",orient="records",lines=True)

## Missing Data in Pandas:

In [167]:
s=pd.Series(["Sam",np.nan,"Tim","Kim"])
s

0    Sam
1    NaN
2    Tim
3    Kim
dtype: object

In [170]:
#to check whether a value is null or not use:.isnull()
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [171]:
s[s.isnull()]

1    NaN
dtype: object

In [172]:
#to check whether it is not null use: .notnull()
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [173]:
s[s.notnull()]

0    Sam
2    Tim
3    Kim
dtype: object

In [174]:
s[3]=None
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [175]:
#to drop all null values use .dropna()
s.dropna()

0    Sam
2    Tim
dtype: object

In [176]:
from numpy import nan as NA

In [177]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [178]:
#if you use .dropna() on a dataframe : it drops the entire row if only 1 null value 
#is found
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [179]:
#if you want to drop only the rows that has all elements=null set how="all"
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [180]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [182]:
df[1]=NA

In [183]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [184]:
df.dropna(axis=1,how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [185]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [186]:
#to copy a dataframe
df2=df.copy()

In [188]:
df2.dropna(thresh=3,inplace=True)#thresh =3 means any row with 2 or less Null values will 
#be dropped
df2

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [189]:
#to fill null values use:.fillna()
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [190]:
#to fill each null in each column with a different value 
df.fillna({0:15,1:25,2:35})

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [191]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [193]:
df.fillna(0,inplace=True)
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [194]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [196]:
#you can use mehod="ffill" or method="bfill" to fill null values
df.fillna(method="ffill")

C:\Users\dell\AppData\Local\Temp\ipykernel_1548\1119510567.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [198]:
#you can set a limit for each column by using limit=limit
df.fillna(method="ffill",limit=1)

C:\Users\dell\AppData\Local\Temp\ipykernel_1548\3929470482.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [199]:
data=pd.Series([1,0,NA,5])
data

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [200]:
#you can fill null values with the mean value 
data.fillna(data.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [201]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [202]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

## Data Transformation in Pandas:

In [203]:
data=pd.DataFrame({"a":["one","two"]*3,
                   "b":[1,1,2,3,2,3]})
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [204]:
#to check for duplicated data we use .duplicated()
data.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [205]:
#to drop duplicates we use .drop_duplicates()
data.drop_duplicates()

     a  b
0  one  1
1  two  1
2  one  2
3  two  3

In [206]:
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [207]:
data["c"]=range(6)
data

     a  b  c
0  one  1  0
1  two  1  1
2  one  2  2
3  two  3  3
4  one  2  4
5  two  3  5

In [208]:
#to check only certain columns for duplicates df_name.duplicated([list of col names])
data.duplicated(["a","b"])

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [209]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [210]:
df=pd.DataFrame({"names":["Tim","tom","Sam",
                          "kate","Kim"],
                "scores":[60,50,70,80,40]})
df

  names  scores
0   Tim      60
1   tom      50
2   Sam      70
3  kate      80
4   Kim      40

In [211]:
classes={"Tim":"A","Tom":"A","Sam":"B",
         "Kate":"B","Kim":"B"}

In [213]:
n=df["names"].str.capitalize()
n

0     Tim
1     Tom
2     Sam
3    Kate
4     Kim
Name: names, dtype: object

In [216]:
classes

{'Tim': 'A', 'Tom': 'A', 'Sam': 'B', 'Kate': 'B', 'Kim': 'B'}

In [217]:
df["Branches"]=n.map(classes)
#n hold a series of names Tim,Tom ...etc,
#classes is a dict containing Tim: value, Tom:value,...etc
#map function maps values from classes to names in n
#so it creates a series A,A,B,B,B
#which is added as a new column in the dataframe

In [215]:
df

  names  scores Branches
0   Tim      60        A
1   tom      50        A
2   Sam      70        B
3  kate      80        B
4   Kim      40        B

In [218]:
s=pd.Series([80,70,90,60])
s

0    80
1    70
2    90
3    60
dtype: int64

In [219]:
#to replace a value in a series, use .replace(value to be replaced,new value)
s.replace(70,np.nan)

0    80.0
1     NaN
2    90.0
3    60.0
dtype: float64

In [220]:
#you can replace more than one value using .replace([list of values to be replaced],
#[list of new values])
s

0    80
1    70
2    90
3    60
dtype: int64

In [221]:
s.replace([70,60],[np.nan,0])

0    80.0
1     NaN
2    90.0
3     0.0
dtype: float64

In [223]:
#or using dictionary style .replace(replaced_value:ne_value,replaced_value:new_value,..etc)
s.replace({90:100,60:0})

0     80
1     70
2    100
3      0
dtype: int64

**.map() function**:
The .map() function is a versatile tool used for transforming data by mapping values from one set to another. It's available in several programming languages and data analysis libraries, including Python's pandas.

Generally, the .map() function takes a Series or list and a dictionary, another Series, or a function as an argument. It then iterates through each element of the Series or list and replaces it with its corresponding mapped value.

How it Works
Imagine you have a list of values and a lookup table. The map function goes through each value in your list, finds it in the lookup table, and returns the associated value.

Input: A Series or a list of values you want to transform.

Mapping: A dictionary, Series, or function that provides the mapping logic.

Using a Dictionary: The keys of the dictionary are the original values, and the values of the dictionary are the new, transformed values.

Using a Function: The function takes each value from the Series as an input and returns the transformed value.

In [227]:
#example on map
# Create a DataFrame with a 'product_code' column
products = pd.DataFrame({'product_code': ['A1', 'B2', 'A1', 'C3', 'B2']})

# Create a dictionary to map product codes to product names
product_names = {'A1': 'Laptop', 'B2': 'Mouse', 'C3': 'Keyboard'}

# Map the 'product_code' column to the product_names dictionary
products['product_name'] = products['product_code'].map(product_names)

print(products)

  product_code product_name
0           A1       Laptop
1           B2        Mouse
2           A1       Laptop
3           C3     Keyboard
4           B2        Mouse

In [228]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=[0,1,2],
    columns=["tim","tom","kim","sam"])
df

   tim  tom  kim  sam
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [230]:
s=pd.Series(["one","two","three"])
df.index=df.index.map(s)
df

       tim  tom  kim  sam
one      0    1    2    3
two      4    5    6    7
three    8    9   10   11

In [234]:
#you can use rename function .rename(index=rename_method,columns=rename_method)
#to rename index and columns names
df.rename(index=str.capitalize,columns=str.title)

       Tim  Tom  Kim  Sam
One      0    1    2    3
Two      4    5    6    7
Three    8    9   10   11

In [236]:
#or use dictionary style renaming
df.rename(index={"one":"ten"},columns={"sam":"kate"},inplace=True)
df

       tim  tom  kim  kate
ten      0    1    2     3
two      4    5    6     7
three    8    9   10    11

In [237]:
data=pd.DataFrame(np.random.randn(1000,4)) #shape is (1000,4)
data.head()

          0         1         2         3
0 -1.591110 -0.320200 -1.145301 -0.960590
1 -1.484700 -0.091830  0.425149  0.281388
2 -1.729363 -0.993261 -0.032554  0.451838
3 -0.102852  0.625549  0.592757  0.427187
4 -0.705440  0.612562  1.427570 -0.313248

In [238]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.018850    -0.022053    -0.076944     0.004053
std       1.035455     0.998286     0.980746     1.005968
min      -2.964414    -3.314615    -3.231554    -2.889539
25%      -0.688271    -0.643430    -0.768704    -0.654776
50%       0.025244    -0.002242    -0.082844     0.026413
75%       0.742291     0.630844     0.561464     0.691357
max       3.294194     3.201658     3.212805     2.923690

In [241]:
#to get sign of a data whether + or -ve: use np.sign(series_name)or np.sign(dataframe)
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0 -1.0

In [242]:
data=pd.DataFrame(
    np.arange(12).reshape(4,3))
data

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [244]:
#np.random.permutation(n) creates a numpy array from 0 to n-1 and returns it in a 
#randomly shuffled order
rw=np.random.permutation(4)
rw

array([1, 3, 0, 2])

In [245]:
#.take() method:takes a list of integers as indeces and returns the dataframe
#arranged by rows according to those indeces
data.take(rw)

   0   1   2
1  3   4   5
3  9  10  11
0  0   1   2
2  6   7   8

**.sample(n)**:
the .sample() method in pandas is used to randomly select a sample of rows or columns from a DataFrame. This is useful for tasks like splitting a dataset, drawing random subsets for analysis, or creating smaller data for testing.

How it Works
The .sample() method is highly flexible and has several key parameters:

n: The number of items (rows) to return. For example, data.sample(n=10) will return 10 random rows.

frac: The fraction of items to return. For example, data.sample(frac=0.5) will return 50% of the rows. This is often more convenient than n.

replace: Whether to sample with replacement (True) or without replacement (False, the default). Sampling with replacement means the same row can be selected more than once.

random_state: A seed for the random number generator. Using a random_state (e.g., random_state=42) ensures that your sample is reproducible, meaning you'll get the same random rows every time you run the code. This is essential for reproducibility in data science.

axis: Whether to sample rows (axis=0, the default) or columns (axis=1).

In [246]:
data.sample(n=2)

   0  1  2
0  0  1  2
2  6  7  8

## Dummy Variable

A dummy variable is a numerical variable used in regression analysis to represent a categorical variable. Dummy variables can only take on a value of 0 or 1. A "1" indicates the presence of a specific category, and a "0" indicates its absence. This conversion is necessary because regression models and other machine learning algorithms require numerical input and cannot directly process text-based categories.




pandas.get_dummies()
The pd.get_dummies() function is a powerful and widely used method in pandas that converts categorical data into dummy variables. It performs a process called one-hot encoding.


How It Works
For each unique value in a categorical column, get_dummies() creates a new column. The new columns are binary (containing only 0s and 1s), representing each unique category.


For a column with k unique categories, get_dummies() will create k new columns.

Example
Consider a DataFrame with a Color column:

ID	Color
1	Red
2	Blue
3	Red
4	Green
Using pd.get_dummies(df['Color']) would transform this into a new DataFrame with three columns (one for each unique color):

Red	Blue	Green
1	0	0
0	1	0
1	0	0
0	0	1
As you can see, for each original row, only the column corresponding to its color has a "1", while the others are "0".

The drop_first Parameter
A common issue with one-hot encoding is multicollinearity, where one dummy variable can be perfectly predicted from the others. For instance, if you know a color is not Red and not Green, it must be Blue. This can cause problems in some regression models.

To avoid this, you can use the drop_first=True argument. This drops one of the dummy columns, leaving k−1 columns. The information is still retained, as the dropped column is represented by all 0s across the remaining columns.

Blue	Green
0	0
1	0
0	0
0	1

In [247]:
data=pd.DataFrame(
    {"letter":["c","b","a","b","b","a"],
                   "number":range(6)})
data

  letter  number
0      c       0
1      b       1
2      a       2
3      b       3
4      b       4
5      a       5

In [251]:
pd.get_dummies(data["letter"])

       a      b      c
0  False  False   True
1  False   True  False
2   True  False  False
3  False   True  False
4  False   True  False
5   True  False  False

**the pd.cut()**:
The pd.cut() function in pandas is used to bin or discretize a continuous numerical array into discrete intervals. It's a fundamental tool for converting continuous data into categorical data.

How It Works
pd.cut() takes a Series or array of numbers and divides the entire range of those numbers into a set of specified intervals. It then assigns each number to the bin it falls into.

The output is a pandas Categorical object, where the values are the bins themselves, represented as intervals like (10, 20].

Key Parameters:
x: The array or Series to be binned.

bins: This parameter is crucial and can be specified in a few ways:

An integer: The most common usage. For example, bins=4 will divide the range of x into 4 equally sized intervals.

A list of scalars: You can manually define the bin edges. For example, bins=[0, 10, 25, 50] will create three bins: (0, 10], (10, 25], and (25, 50].

right: A boolean that determines if the bins include the rightmost edge. True (the default) means the interval is (a, b], while False means it's (a, b).

labels: You can provide a list of custom labels for the bins instead of the default interval notation.

In [254]:
data=np.random.randn(10)
data

array([ 0.52107282, -0.76982419, -1.47987952, -1.81426714,  0.32923577,
       -0.10589915,  0.86295494, -1.8373892 ,  0.29408366, -0.15712881])

In [255]:
intervals=pd.cut(data,4)
intervals

[(0.188, 0.863], (-1.162, -0.487], (-1.84, -1.162], (-1.84, -1.162], (0.188, 0.863], (-0.487, 0.188], (0.188, 0.863], (-1.84, -1.162], (0.188, 0.863], (-0.487, 0.188]]
Categories (4, interval[float64, right]): [(-1.84, -1.162] < (-1.162, -0.487] < (-0.487, 0.188] < (0.188, 0.863]]

In [256]:
pd.get_dummies(intervals)

   (-1.84, -1.162]  (-1.162, -0.487]  (-0.487, 0.188]  (0.188, 0.863]
0            False             False            False            True
1            False              True            False           False
2             True             False            False           False
3             True             False            False           False
4            False             False            False            True
5            False             False             True           False
6            False             False            False            True
7             True             False            False           False
8            False             False            False            True
9            False             False             True           False

## Hierarchial indexing in pandas

In [273]:
data=pd.Series(np.random.randn(8),
               index=[["a","a","a","b",
                       "b","b","c","c"],#outermost index
                      [1,2,3,1,2,3,1,2]])#innermost index
data
#each mention for the same outermost index takes a value for the innermost index
# "a","a","a" was mentioned three times so it takes 1,2,3 as inner index
#"b","b","b" was mentioned three times so it takes 1,2,3 as inner index
#"c","c" was mentioned two times so it takes 1,2 as inner index

a  1    0.845933
   2    0.293645
   3    1.146230
b  1   -1.245671
   2    0.838310
   3   -1.139752
c  1   -0.195637
   2    0.046089
dtype: float64

In [274]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2)],
           )

In [275]:
data["a"]

1    0.845933
2    0.293645
3    1.146230
dtype: float64

In [276]:
data["b":"c"]

b  1   -1.245671
   2    0.838310
   3   -1.139752
c  1   -0.195637
   2    0.046089
dtype: float64

In [277]:
data.loc[["a","c"]]

a  1    0.845933
   2    0.293645
   3    1.146230
c  1   -0.195637
   2    0.046089
dtype: float64

In [278]:
data.loc[:,1]

a    0.845933
b   -1.245671
c   -0.195637
dtype: float64

**the .unstack() method**:
The data.unstack() method transforms a Series with a MultiIndex (a hierarchical index with multiple levels) into a DataFrame. It takes the innermost level of the index and pivots it to become the new column headings.

How it Works
In your code, the data Series has a two-level index:

Level 0: ["a", "a", "a", "b", "b", "b", "c", "c"]

Level 1: [1, 2, 3, 1, 2, 3, 1, 2]

The data.unstack() command takes the innermost level of this index (Level 1: [1, 2, 3]) and makes those values into the new columns. The remaining outer index (Level 0: ["a", "b", "c"]) becomes the new row index.

The values from the original Series are then filled into the appropriate cells in the new DataFrame.

Here's a step-by-step visual of the transformation:

1. The Original MultiIndex Series:
The data is organized by two levels of indexing. For example, a is a group with sub-indices 1, 2, and 3.

In [279]:
data.unstack()

          1         2         3
a  0.845933  0.293645  1.146230
b -1.245671  0.838310 -1.139752
c -0.195637  0.046089       NaN

**the .stack() method**:
The .stack() method is the inverse of .unstack(). It takes a DataFrame and transforms it into a Series with a MultiIndex. It "stacks" the column names as the innermost level of a new hierarchical row index.

How It Works
stack() takes the column headings of a DataFrame and rotates them to become the innermost level of the index. This is useful for reshaping data from a "wide" format to a "long" format.

For a DataFrame with a simple index, stack() will create a two-level MultiIndex. The outer level will be the original row index, and the inner level will be the original column names.

In [280]:
data.unstack().stack()

a  1    0.845933
   2    0.293645
   3    1.146230
b  1   -1.245671
   2    0.838310
   3   -1.139752
c  1   -0.195637
   2    0.046089
dtype: float64

In [268]:
df=pd.DataFrame(
    np.arange(12).reshape(4,3),
    index=[["a","a","b","b"],
           [1,2,1,2]],
    columns=[["num","num","ver"],["math","sta","geo"]])
df

     num     ver
    math sta geo
a 1    0   1   2
  2    3   4   5
b 1    6   7   8
  2    9  10  11

In [269]:
df.index.names=["class","exam"] #two names because we have 2 index levels
df.columns.names=["field","lesson"]#two names because we have 2 column fields
df

field       num     ver
lesson     math sta geo
class exam
a     1       0   1   2
      2       3   4   5
b     1       6   7   8
      2       9  10  11

In [270]:
df["num"]

lesson      math  sta
class exam
a     1        0    1
      2        3    4
b     1        6    7
      2        9   10

In [281]:
df["ver"]

lesson      geo
class exam
a     1       2
      2       5
b     1       8
      2      11

In [282]:
#to swap 2 indeces levels we use swap level 
df.swaplevel("class","exam")

field       num     ver
lesson     math sta geo
exam class
1    a        0   1   2
2    a        3   4   5
1    b        6   7   8
2    b        9  10  11

In [283]:
df

field       num     ver
lesson     math sta geo
class exam
a     1       0   1   2
      2       3   4   5
b     1       6   7   8
      2       9  10  11

In [284]:
df.sort_index(level=1)#will sort based on index 1 which is exam

field       num     ver
lesson     math sta geo
class exam
a     1       0   1   2
b     1       6   7   8
a     2       3   4   5
b     2       9  10  11

In [285]:
df.sort_index(level=0)#will sort on index 0 which is class

field       num     ver
lesson     math sta geo
class exam
a     1       0   1   2
      2       3   4   5
b     1       6   7   8
      2       9  10  11

## Indexing with a DataFrame’s columns:

In [286]:
data=pd.DataFrame(
    {"x":range(8),"y":range(8,0,-1),
     "a":["one","one","one","one","two",
          "two","two","two"],
     "b":[0,1,2,3,0,1,2,3]})
data

   x  y    a  b
0  0  8  one  0
1  1  7  one  1
2  2  6  one  2
3  3  5  one  3
4  4  4  two  0
5  5  3  two  1
6  6  2  two  2
7  7  1  two  3

In [287]:
#to index the data with a certain column we use .set_index([list of columns names])
data.set_index("a")

     x  y  b
a
one  0  8  0
one  1  7  1
one  2  6  2
one  3  5  3
two  4  4  0
two  5  3  1
two  6  2  2
two  7  1  3

In [289]:
data2=data.set_index("b")
data2

   x  y    a
b
0  0  8  one
1  1  7  one
2  2  6  one
3  3  5  one
0  4  4  two
1  5  3  two
2  6  2  two
3  7  1  two

In [290]:
data2.loc[0]

   x  y    a
b
0  0  8  one
0  4  4  two

In [292]:
data2["x"]

b
0    0
1    1
2    2
3    3
0    4
1    5
2    6
3    7
Name: x, dtype: int64

In [293]:
data

   x  y    a  b
0  0  8  one  0
1  1  7  one  1
2  2  6  one  2
3  3  5  one  3
4  4  4  two  0
5  5  3  two  1
6  6  2  two  2
7  7  1  two  3

In [298]:
data2=data.set_index(["a","b"])
data2

       x  y
a   b
one 0  0  8
    1  1  7
    2  2  6
    3  3  5
two 0  4  4
    1  5  3
    2  6  2
    3  7  1

In [299]:
data3=data.set_index(["a","b"],drop=False)
data3

       x  y    a  b
a   b
one 0  0  8  one  0
    1  1  7  one  1
    2  2  6  one  2
    3  3  5  one  3
two 0  4  4  two  0
    1  5  3  two  1
    2  6  2  two  2
    3  7  1  two  3

In [301]:
#to reset index after it was set we use .restet index
data2.reset_index()

     a  b  x  y
0  one  0  0  8
1  one  1  1  7
2  one  2  2  6
3  one  3  3  5
4  two  0  4  4
5  two  1  5  3
6  two  2  6  2
7  two  3  7  1

## Combining & Merging Datasets in Pandas:

In [302]:
d1=pd.DataFrame(
    {"key":["a","b","c","c","d","e"],
     "num1":range(6)})

d2=pd.DataFrame(
    {"key":["b","c","e","f"],
     "num2":range(4)})

In [303]:
print(d1)
print(d2)

  key  num1
0   a     0
1   b     1
2   c     2
3   c     3
4   d     4
5   e     5
  key  num2
0   b     0
1   c     1
2   e     2
3   f     3

pd.merge(d1, d2) performs a database-style join to combine two DataFrames, d1 and d2, based on one or more common columns (keys).

By default, this function performs an inner join, which means it only includes rows where the key column values are present in both DataFrames. The result is a new DataFrame containing a combination of the columns from d1 and d2 for these matching rows.

How It Works
pd.merge() automatically tries to find a common column name between the two DataFrames to use as the join key. If there are no common column names, you'll need to specify them using the on, left_on, or right_on parameters.

In [304]:
pd.merge(d1,d2)

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [305]:
pd.merge(d1,d2,on='key')

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [306]:
d3=pd.DataFrame(
    {"key1":["a","b","c","c","d","e"],
     "num1":range(6)})
d4=pd.DataFrame(
    {"key2":["b","c","e","f"],
     "num2":range(4)})

In [307]:
print(d3)
print(d4)

  key1  num1
0    a     0
1    b     1
2    c     2
3    c     3
4    d     4
5    e     5
  key2  num2
0    b     0
1    c     1
2    e     2
3    f     3

In [308]:
pd.merge(d3,d4,left_on='key1',right_on='key2')#left_on tells the merge which column
#on the left dataframe d3 to use as key, and right_on tells merge which column on 
#right_dataframe to use as key

  key1  num1 key2  num2
0    b     1    b     0
1    c     2    c     1
2    c     3    c     1
3    e     5    e     2

pd.merge(d1,d2,how=value) : 
**the how parameter:**
The how parameter in pd.merge() specifies the type of join to perform. It determines how the two DataFrames, d1 and d2, are combined, particularly in cases where a key from one DataFrame does not have a match in the other.

The how parameter can take four main values:

'inner' (default): Includes only the rows with keys that exist in both DataFrames. Rows with non-matching keys are dropped.

'outer': Includes all rows from both DataFrames. Where there is no match, the missing values are filled with NaN (Not a Number).

'left': Includes all rows from the left DataFrame (d1) and only the matching rows from the right DataFrame (d2). Non-matching rows from the left are preserved, with NaN in the columns from the right DataFrame.

'right': Includes all rows from the right DataFrame (d2) and only the matching rows from the left DataFrame (d1). Non-matching rows from the right are preserved, with NaN in the columns from the left DataFrame.

In [309]:
print(d1)
print(d2)

  key  num1
0   a     0
1   b     1
2   c     2
3   c     3
4   d     4
5   e     5
  key  num2
0   b     0
1   c     1
2   e     2
3   f     3

In [310]:
pd.merge(d1, d2, how="outer")

  key  num1  num2
0   a   0.0   NaN
1   b   1.0   0.0
2   c   2.0   1.0
3   c   3.0   1.0
4   d   4.0   NaN
5   e   5.0   2.0
6   f   NaN   3.0

In [311]:
pd.merge(d1, d2, how="left")

  key  num1  num2
0   a     0   NaN
1   b     1   0.0
2   c     2   1.0
3   c     3   1.0
4   d     4   NaN
5   e     5   2.0

In [312]:
pd.merge(d1, d2, how="right")

  key  num1  num2
0   b   1.0     0
1   c   2.0     1
2   c   3.0     1
3   e   5.0     2
4   f   NaN     3

In [313]:
pd.merge(d1, d2, how="inner")

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [314]:
df1=pd.DataFrame(
    {"key":["a","b","c","c","d","e"],
     "num1":range(6),
     "count":["one","three","two",
              "one","one","two"]})
df2=pd.DataFrame(
    {"key":["b","c","e","f"],
     "num2":range(4),
     "count":["one","two","two","two"]})

In [315]:
print(df1)
print(df2)

  key  num1  count
0   a     0    one
1   b     1  three
2   c     2    two
3   c     3    one
4   d     4    one
5   e     5    two
  key  num2 count
0   b     0   one
1   c     1   two
2   e     2   two
3   f     3   two

In [316]:
pd.merge(df1, df2, on=['key', 'count'], 
         how='outer')

  key  num1  count  num2
0   a   0.0    one   NaN
1   b   1.0  three   NaN
2   c   2.0    two   1.0
3   c   3.0    one   NaN
4   d   4.0    one   NaN
5   e   5.0    two   2.0
6   b   NaN    one   0.0
7   f   NaN    two   3.0

In [317]:
pd.merge(df1, df2, on="key", how='outer')

  key  num1 count_x  num2 count_y
0   a   0.0     one   NaN     NaN
1   b   1.0   three   0.0     one
2   c   2.0     two   1.0     two
3   c   3.0     one   1.0     two
4   d   4.0     one   NaN     NaN
5   e   5.0     two   2.0     two
6   f   NaN     NaN   3.0     two

In [318]:
#to add suffixes if columns in dataframes have the same name
pd.merge(df1, df2, 
         on='key', 
         suffixes=('_data1', '_data2'))

  key  num1 count_data1  num2 count_data2
0   b     1       three     0         one
1   c     2         two     1         two
2   c     3         one     1         two
3   e     5         two     2         two

## Merging on index:

In [320]:
df1=pd.DataFrame(
    {"letter":["a","a","b",
               "b","a","c"],
     "num":range(6)}) 
df2=pd.DataFrame(
    {"value":[3,5,7]},
    index=["a","b","e"])
print(df1)
print(df2)

  letter  num
0      a    0
1      a    1
2      b    2
3      b    3
4      a    4
5      c    5
   value
a      3
b      5
e      7

In [321]:
pd.merge(df1,df2,
         left_on="letter",#matches on the column letter from dataframe 1 to
         right_index=True)# the index from df2

  letter  num  value
0      a    0      3
1      a    1      3
4      a    4      3
2      b    2      5
3      b    3      5

In [322]:
right=pd.DataFrame(
    [[1,2],[3,4],[5,6]],
    index=["a","c","d"],
    columns=["Tom","Tim"])
left=pd.DataFrame(
    [[7,8],[9,10],[11,12],[13,14]],
    index=["a","b","e","f"],
    columns=["Sam","Kim"])
print(right)
print(left)

   Tom  Tim
a    1    2
c    3    4
d    5    6
   Sam  Kim
a    7    8
b    9   10
e   11   12
f   13   14

In [324]:
pd.merge(right,left, 
         right_index=True, 
         left_index=True, 
         how="outer")#will merge based on right index and left index with outer technique

   Tom  Tim   Sam   Kim
a  1.0  2.0   7.0   8.0
b  NaN  NaN   9.0  10.0
c  3.0  4.0   NaN   NaN
d  5.0  6.0   NaN   NaN
e  NaN  NaN  11.0  12.0
f  NaN  NaN  13.0  14.0

**the .join() method:**
having two dataframes left,right.
left.join(right) is a convenient method for combining two DataFrames, left and right, by their indexes. It's a shorthand for pd.merge() when you want to join on indexes, and it performs a left join by default.

How it Works
Left Join: The .join() method keeps all the rows from the left DataFrame (left) and matches them with rows from the right DataFrame based on their indexes.

Missing Matches: If a row's index in the left DataFrame does not have a corresponding index in the right DataFrame, the columns from the right DataFrame will be filled with NaN (Not a Number) for that row.

Merge on Index: The join is performed on the DataFrame's index by default. This is a key difference from pd.merge(), which by default joins on columns.

You can specify which columns to join on using the on parameter, and you can change the join type using the how parameter (e.g., 'inner', 'outer', 'right'). by default it is left join

In [325]:
left.join(right)
# is equivalent to pd.merge(left,right,left_index=True,right_index=True,how='left')

   Sam  Kim  Tom  Tim
a    7    8  1.0  2.0
b    9   10  NaN  NaN
e   11   12  NaN  NaN
f   13   14  NaN  NaN

In [326]:
pd.merge(left,right,left_index=True,right_index=True,how='left')

   Sam  Kim  Tom  Tim
a    7    8  1.0  2.0
b    9   10  NaN  NaN
e   11   12  NaN  NaN
f   13   14  NaN  NaN

In [327]:
left.join(right,how='outer')

    Sam   Kim  Tom  Tim
a   7.0   8.0  1.0  2.0
b   9.0  10.0  NaN  NaN
c   NaN   NaN  3.0  4.0
d   NaN   NaN  5.0  6.0
e  11.0  12.0  NaN  NaN
f  13.0  14.0  NaN  NaN

In [328]:
left.join(right,how='inner')

   Sam  Kim  Tom  Tim
a    7    8    1    2

In [329]:
left.join(right,how='right')

   Sam  Kim  Tom  Tim
a  7.0  8.0    1    2
c  NaN  NaN    3    4
d  NaN  NaN    5    6

In [330]:
data=pd.DataFrame([[1,3],[5,7],[9,11]],            
                  index=["a","b","f"],      
                  columns=["Alex","Keta"])
data

   Alex  Keta
a     1     3
b     5     7
f     9    11

In [331]:
#you can join more than 2 dataframes using .join
left.join([right,data])

    Sam   Kim  Tom  Tim  Alex  Keta
a   7.0   8.0  1.0  2.0   1.0   3.0
b   9.0  10.0  NaN  NaN   5.0   7.0
e  11.0  12.0  NaN  NaN   NaN   NaN
f  13.0  14.0  NaN  NaN   9.0  11.0

## Concatenating Along an Axis:

In [332]:
seq= np.arange(20).reshape((4, 5))
seq

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

**Concatenating np.arrays**:
The function np.concatenate([seq, seq], axis=1) joins the NumPy array seq with itself along the second axis (axis=1). For a 2D array, axis=1 refers to the columns.

How It Works
np.concatenate(): The function that joins arrays.

[seq, seq]: The arrays to be joined. In this case, seq is joined with a copy of itself.

axis=1: This tells NumPy to stack the arrays side by side, effectively joining them horizontally. The number of columns in the resulting array will be the sum of the columns of the arrays being concatenated.

Since the original array seq has a shape of (4, 5), the resulting array will have a new shape of (4, 10), as the 5 columns from each array are combined.
if axis =0 the result will be (8,5)

In [333]:
np.concatenate([seq,seq], axis=0)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [336]:
np.concatenate([seq,seq], axis=1)

array([[ 0,  1,  2,  3,  4,  0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19, 15, 16, 17, 18, 19]])

In [337]:
data1 = pd.Series(
    [0, 1], index=['a', 'b'])
data2 = pd.Series(
    [2,3,4], index=['c','d','e'])
data3 = pd.Series(
    [5, 6], index=['f', 'g'])

In [338]:
pd.concat([data1,data2,data3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [339]:
pd.concat([data1,data2,data3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [340]:
data4= pd.Series([10,11,12], 
                 index=['a','b',"c"])
data4

a    10
b    11
c    12
dtype: int64

In [341]:
data1

a    0
b    1
dtype: int64

In [342]:
pd.concat([data1,data4],axis=1, join="inner")

   0   1
a  0  10
b  1  11

In [343]:
x=pd.concat([data1, data2, data4], 
            keys=['one', 'two','three'])
x

one    a     0
       b     1
two    c     2
       d     3
       e     4
three  a    10
       b    11
       c    12
dtype: int64

In [344]:
x=pd.concat([data1, data2, data4], 
            axis=1,
            keys=['one', 'two', 'three'])
x

   one  two  three
a  0.0  NaN   10.0
b  1.0  NaN   11.0
c  NaN  2.0   12.0
d  NaN  3.0    NaN
e  NaN  4.0    NaN

In [345]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['one', 'two'])
    
df2 = pd.DataFrame(
    10+np.arange(4).reshape(2,2),
    index=['a', 'c'],
    columns=['three', 'four'])

In [346]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [347]:
df2

   three  four
a     10    11
c     12    13

In [348]:
pd.concat([df1,df2],axis=1,keys=['s1','s2'],sort=False)

   s1        s2
  one two three  four
a   0   1  10.0  11.0
b   2   3   NaN   NaN
c   4   5  12.0  13.0

In [349]:
data1 = pd.DataFrame(
    np.random.randn(3, 4),
    columns=['a','b','c','d'])
    
data2 = pd.DataFrame(
    np.random.randn(2, 3),
    columns=['b','d','a'])

In [350]:
data1

          a         b         c         d
0 -0.945045  0.100696  2.309516  0.832984
1 -0.553649 -0.332360  0.349713 -0.737733
2  0.726537 -1.037745  0.440558  1.541982

In [351]:
data2

          b         d        a
0  1.040659 -1.650127 -0.59135
1  0.395059  0.129391  0.47162

In [352]:
pd.concat([data1, data2], ignore_index=True)#will make new indeces and ignore old ones

          a         b         c         d
0 -0.945045  0.100696  2.309516  0.832984
1 -0.553649 -0.332360  0.349713 -0.737733
2  0.726537 -1.037745  0.440558  1.541982
3 -0.591350  1.040659       NaN -1.650127
4  0.471620  0.395059       NaN  0.129391

In [353]:
pd.concat([data1, data2])

          a         b         c         d
0 -0.945045  0.100696  2.309516  0.832984
1 -0.553649 -0.332360  0.349713 -0.737733
2  0.726537 -1.037745  0.440558  1.541982
0 -0.591350  1.040659       NaN -1.650127
1  0.471620  0.395059       NaN  0.129391

## Reshaping & Pivoting in Pandas:

In [354]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=[list("aabb"),[1,2]*2],
    columns=[["num","num",
              "comp","comp"],
             ["math","stat"]*2])
data

     num      comp
    math stat math stat
a 1    0    1    2    3
  2    4    5    6    7
b 1    8    9   10   11
  2   12   13   14   15

In [355]:
data.index.names=["class","exam"]
data.columns.names=["field","lesson"]
data

field       num      comp
lesson     math stat math stat
class exam
a     1       0    1    2    3
      2       4    5    6    7
b     1       8    9   10   11
      2      12   13   14   15

In [357]:
long=data.stack()
long

field              num  comp
class exam lesson
a     1    math      0     2
           stat      1     3
      2    math      4     6
           stat      5     7
b     1    math      8    10
           stat      9    11
      2    math     12    14
           stat     13    15

The data.stack() method will transform the DataFrame from a "wide" format to a "long" format by pivoting the innermost column level to the row index.

Here's a detailed breakdown of the process:

1. The Original DataFrame
The code creates a DataFrame with a hierarchical index (MultiIndex) for both rows and columns.

Row Index:

level 0 (named "class"): a, a, b, b

level 1 (named "exam"): 1, 2, 1, 2

Column Index:

level 0 (named "field"): num, num, comp, comp

level 1 (named "lesson"): math, stat, math, stat

The DataFrame looks like this:

field    num        comp
lesson  math  stat  math  stat
class exam
a     1      0     1     2     3
      2      4     5     6     7
b     1      8     9    10    11
      2     12    13    14    15
2. The .stack() Operation
data.stack() takes the innermost column index level ("lesson") and pivots it to become the innermost row index level. The columns are now gone, and the data is re-arranged into a single Series with a new, three-level hierarchical index.

The new index levels will be:

level 0 (original row index class): a, b

level 1 (original row index exam): 1, 2

level 2 (original column index lesson): math, stat

In [361]:
long.unstack()

field       num      comp
lesson     math stat math stat
class exam
a     1       0    1    2    3
      2       4    5    6    7
b     1       8    9   10   11
      2      12   13   14   15

In [359]:
data

field       num      comp
lesson     math stat math stat
class exam
a     1       0    1    2    3
      2       4    5    6    7
b     1       8    9   10   11
      2      12   13   14   15

In [360]:
data.stack()

field              num  comp
class exam lesson
a     1    math      0     2
           stat      1     3
      2    math      4     6
           stat      5     7
b     1    math      8    10
           stat      9    11
      2    math     12    14
           stat     13    15

In [362]:
data.stack("field") #will take the field from columns and make it the inner level 
#of row index

lesson            math  stat
class exam field
a     1    comp      2     3
           num       0     1
      2    comp      6     7
           num       4     5
b     1    comp     10    11
           num       8     9
      2    comp     14    15
           num      12    13

In [363]:
s1=pd.Series(
    np.arange(4),index=list("abcd"))
s2=pd.Series(
    np.arange(6,9),index=list("cde"))
print(s1)
print(s2)

a    0
b    1
c    2
d    3
dtype: int32
c    6
d    7
e    8
dtype: int32

In [364]:
data2=pd.concat([s1,s2], keys=["bir","iki"])#making a key for each series
data2

bir  a    0
     b    1
     c    2
     d    3
iki  c    6
     d    7
     e    8
dtype: int32

In [365]:
data2.unstack()

       a    b    c    d    e
bir  0.0  1.0  2.0  3.0  NaN
iki  NaN  NaN  6.0  7.0  8.0

In [366]:
data2.unstack().stack(dropna=False)

bir  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
iki  a    NaN
     b    NaN
     c    6.0
     d    7.0
     e    8.0
dtype: float64

## Pivoting “Long” to “Wide” Format:

In [368]:
stock=pd.DataFrame(
    {"fruit": ["apple", "plum","grape"]*2,
     "color": ["purple","yellow"]*3,
     "piece":[3,4,5,6,1,2]})
stock

   fruit   color  piece
0  apple  purple      3
1   plum  yellow      4
2  grape  purple      5
3  apple  yellow      6
4   plum  purple      1
5  grape  yellow      2

**the .pivot_table() method**:
The .pivot_table() function in pandas is used to create a new DataFrame that summarizes or aggregates data from a "long" or un-pivoted format. It works like a spreadsheet pivot table, allowing you to slice and dice your data to analyze relationships between different variables.

How It Works
A pivot table rearranges a DataFrame with three key components:

index: The column or columns that will form the new index (rows).

columns: The column or columns that will form the new columns.

values: The column or columns whose values will be aggregated in the new table.

You can also specify an aggfunc (aggregation function) to determine how the values are summarized. By default, it uses the mean.

In [369]:
stock.pivot_table(index="fruit",columns="color",values="piece",aggfunc="sum")

color  purple  yellow
fruit
apple       3       6
grape       5       2
plum        1       4

In [370]:
stock["value"]=np.random.randn(len(stock))

In [371]:
stock

   fruit   color  piece     value
0  apple  purple      3  0.870913
1   plum  yellow      4 -0.602802
2  grape  purple      5 -0.714807
3  apple  yellow      6  0.372821
4   plum  purple      1 -0.033211
5  grape  yellow      2  1.973884

**the .pivot() method**:
The .pivot() function in pandas is used to reshape a DataFrame from a "long" format to a "wide" format. It's a powerful tool that rearranges data based on specific columns, creating a new table that is often more intuitive for analysis.

How It Works
pivot() takes three arguments to restructure a DataFrame:

index: The column whose unique values will form the new rows of the pivoted DataFrame.

columns: The column whose unique values will form the new columns.

values: The column that provides the values to fill the new table.

It's important to note that unlike .pivot_table(), .pivot() does not perform any aggregation. This means it can only be used when there is a unique combination of index and columns values for each values entry. If you have duplicate entries, it will raise an error.

In [373]:
p=stock.pivot(index="fruit",columns="color")
p

       piece            value
color purple yellow    purple    yellow
fruit
apple      3      6  0.870913  0.372821
grape      5      2 -0.714807  1.973884
plum       1      4 -0.033211 -0.602802

In [374]:
p["value"]

color    purple    yellow
fruit
apple  0.870913  0.372821
grape -0.714807  1.973884
plum  -0.033211 -0.602802

## Pivoting “Wide” to “Long” Format:

In [375]:
data=pd.DataFrame(
    {"lesson":["math","stat","bio"],
     "Sam":[50,60,70],
     "Kim":[80,70,90],
     "Tom":[60,70,85]})
data

  lesson  Sam  Kim  Tom
0   math   50   80   60
1   stat   60   70   70
2    bio   70   90   85

In [376]:
group = pd.melt(data,["lesson"])
group

  lesson variable  value
0   math      Sam     50
1   stat      Sam     60
2    bio      Sam     70
3   math      Kim     80
4   stat      Kim     70
5    bio      Kim     90
6   math      Tom     60
7   stat      Tom     70
8    bio      Tom     85

**the .melt() method**:
The .melt() method in pandas is used to transform a DataFrame from a wide format to a long format. It's the inverse operation of a pivot.

The method "melts" or "unpivots" a DataFrame by turning columns into rows. This is especially useful for making a dataset tidy, which means each variable is a column, and each observation is a row.

How It Works
data: Your original DataFrame in a wide format.

id_vars: These are the columns you want to keep as unique identifiers for the new rows. They will not be melted.

value_vars: These are the columns that you want to unpivot. Their names will become a new column, and their values will be placed into another new column. If you don't specify this, melt will use all columns that are not in id_vars.

var_name: The name you want to give the new column containing the original column names.

value_name: The name for the new column containing the values.

In your code, pd.melt(data, ["lesson"]) performs the following transformation:

id_vars=["lesson"]: The lesson column is specified as the identifier. It will be kept as a column in the new DataFrame.

value_vars (inferred): The remaining columns (Sam, Kim, Tom) are inferred as the variables to be melted.

The names of the melted columns (Sam, Kim, Tom) are placed into a new column called variable (the default var_name).

The values from these columns (50, 60, 70, 80...) are placed into a new column called value (the default value_name).

In [377]:
group=pd.melt(data,id_vars="lesson",var_name="names",value_name="scores")
group

  lesson names  scores
0   math   Sam      50
1   stat   Sam      60
2    bio   Sam      70
3   math   Kim      80
4   stat   Kim      70
5    bio   Kim      90
6   math   Tom      60
7   stat   Tom      70
8    bio   Tom      85

**going from long format to wide format we use .pivot() or .pivot_table() or .unstack()
going from wide to long we use .melt() or .stack()**

## What is Groupby in Pandas?

In [379]:
df=pd.DataFrame(
    {"key1":list("aabbab"),
     "key2":["one","two","three"]*2,
     "data1":np.random.randn(6),
     "data2":np.random.randn(6)})
df

  key1   key2     data1     data2
0    a    one -0.059301  0.645019
1    a    two  2.665925 -0.603548
2    b  three -0.353178 -0.290822
3    b    one -1.618324  0.366984
4    a    two -0.219909 -0.645636
5    b  three -0.504033  2.234808

In [380]:
group=df["data1"].groupby(df["key1"])
group

** The .groupby() method**:
The last line of code, group = df["data1"].groupby(df["key1"]), performs a grouping operation on the DataFrame. It creates a GroupBy object, which is a powerful intermediate structure used for splitting, applying a function, and combining data.

How it Works
Select a Column to Aggregate: df["data1"] selects the data1 column from the DataFrame. This is the data that will be grouped and then operated on.

Specify the Grouping Key: .groupby(df["key1"]) specifies the column key1 as the key for the grouping. Pandas will look for all unique values in this column (a and b in this case) and create separate groups for each.

Create the GroupBy Object: The result is not a DataFrame, but a GroupBy object. This object holds the information about how the data is split into groups, but it hasn't performed any calculations yet.

At this point, you have two logical groups: one for all rows where key1 is a and another for all rows where key1 is b.

To get a meaningful result, you need to apply an aggregation function to this GroupBy object. For example, you could find the mean of data1 for each group:

group.mean(): This would calculate the average of data1 for all rows in group a and the average for all rows in group b.

In [381]:
group.mean()

key1
a    0.795572
b   -0.825179
Name: data1, dtype: float64

In [383]:
df["data2"].groupby(df["key2"]).mean()

key2
one      0.506001
three    0.971993
two     -0.624592
Name: data2, dtype: float64

In [385]:
ave=df["data1"].groupby([df["key1"],df["key2"]]).mean() #grouping by 2 columns
#like grouping by 2 columns as indeces
ave

key1  key2
a     one     -0.059301
      two      1.223008
b     one     -1.618324
      three   -0.428606
Name: data1, dtype: float64

In [389]:
df

  key1   key2     data1     data2
0    a    one -0.059301  0.645019
1    a    two  2.665925 -0.603548
2    b  three -0.353178 -0.290822
3    b    one -1.618324  0.366984
4    a    two -0.219909 -0.645636
5    b  three -0.504033  2.234808

In [392]:
df.groupby(["key1","key2"]).mean()

               data1     data2
key1 key2
a    one   -0.059301  0.645019
     two    1.223008 -0.624592
b    one   -1.618324  0.366984
     three -0.428606  0.971993

## Iterating over Groups:

In [393]:
df.groupby("key1")

In [396]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)
#prints the name, and the group for the corresponding name

a
  key1 key2     data1     data2
0    a  one -0.059301  0.645019
1    a  two  2.665925 -0.603548
4    a  two -0.219909 -0.645636
b
  key1   key2     data1     data2
2    b  three -0.353178 -0.290822
3    b    one -1.618324  0.366984
5    b  three -0.504033  2.234808

In [399]:
for (x1,x2),group in df.groupby(["key1",
                                 "key2"]):
    print(x1,x2)
    print(group)
    print()
#prints the names for each key pairs, and the group for the corresponding pair

a one
  key1 key2     data1     data2
0    a  one -0.059301  0.645019

a two
  key1 key2     data1     data2
1    a  two  2.665925 -0.603548
4    a  two -0.219909 -0.645636

b one
  key1 key2     data1     data2
3    b  one -1.618324  0.366984

b three
  key1   key2     data1     data2
2    b  three -0.353178 -0.290822
5    b  three -0.504033  2.234808

In [403]:
l=list(df.groupby("key1"))
l

[('a',
    key1 key2     data1     data2
  0    a  one -0.059301  0.645019
  1    a  two  2.665925 -0.603548
  4    a  two -0.219909 -0.645636),
 ('b',
    key1   key2     data1     data2
  2    b  three -0.353178 -0.290822
  3    b    one -1.618324  0.366984
  5    b  three -0.504033  2.234808)]

In [404]:
piece=dict(l)
piece

{'a':   key1 key2     data1     data2
 0    a  one -0.059301  0.645019
 1    a  two  2.665925 -0.603548
 4    a  two -0.219909 -0.645636,
 'b':   key1   key2     data1     data2
 2    b  three -0.353178 -0.290822
 3    b    one -1.618324  0.366984
 5    b  three -0.504033  2.234808}

In [405]:
piece["a"]

  key1 key2     data1     data2
0    a  one -0.059301  0.645019
1    a  two  2.665925 -0.603548
4    a  two -0.219909 -0.645636

## Selecting a Column or Subset of Columns

In [406]:
df.groupby(['key1', 
            'key2'])[['data1']].mean()

               data1
key1 key2
a    one   -0.059301
     two    1.223008
b    one   -1.618324
     three -0.428606

## Grouping with Dicts and Series

In [407]:
fruit=pd.DataFrame(np.random.randn(4,4),
                   columns=list("abcd"),
                   index=["apple","cherry",
                          "banana","kiwi"])
fruit

               a         b         c         d
apple  -0.623476  1.866552 -0.064542  2.050000
cherry  1.211605 -0.358272 -0.094073  0.691594
banana -0.871212 -0.581632 -0.858243 -0.419402
kiwi   -1.223506 -0.687056  1.122414 -1.181587

In [408]:
label={"a": "green","b":"yellow",
       "c":"green","d":"yellow",
       "e":"purple"}

In [412]:
group=fruit.groupby(label,axis=1)
group.sum()

C:\Users\dell\AppData\Local\Temp\ipykernel_1548\2297407160.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  group=fruit.groupby(label,axis=1)

           green    yellow
apple  -0.688018  3.916552
cherry  1.117532  0.333322
banana -1.729455 -1.001033
kiwi   -0.101092 -1.868643

## Grouping by Index Levels:

In [414]:
data=pd.DataFrame(np.random.randn(4,5),
                  columns=[list("AAABB"),
                           [1,2,3,1,2]])
data.columns.names=["letter","number"]
data

letter         A                             B
number         1         2         3         1         2
0       0.991625  1.231705 -0.961252 -1.264054 -0.283292
1       1.536548  1.058867 -0.436329  0.202679 -1.206012
2       1.054644  0.110493  0.420842  0.904290 -0.598764
3      -0.405758  0.771943 -0.823342  0.277477  0.001508

In [419]:
for name,group in data.groupby("letter",axis=1):
#axis -1 to indicate that this is a column groupby
    print(name)
    print(group)
    print()

A
letter         A
number         1         2         3
0       0.991625  1.231705 -0.961252
1       1.536548  1.058867 -0.436329
2       1.054644  0.110493  0.420842
3      -0.405758  0.771943 -0.823342

B
letter         B
number         1         2
0      -1.264054 -0.283292
1       0.202679 -1.206012
2       0.904290 -0.598764
3       0.277477  0.001508

C:\Users\dell\AppData\Local\Temp\ipykernel_1548\1662573696.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  for name,group in data.groupby("letter",axis=1):

In [420]:
data.groupby(level="letter",axis=1).sum()

C:\Users\dell\AppData\Local\Temp\ipykernel_1548\249029581.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  data.groupby(level="letter",axis=1).sum()

letter         A         B
0       1.262078 -1.547346
1       2.159085 -1.003332
2       1.585979  0.305525
3      -0.457157  0.278986

# Application with Real Data Set:

In [421]:
games_data=pd.read_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\vgsalesGlobale.csv")

In [422]:
games_data.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [423]:
games_data.tail()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.0,0.0,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.0,0.0,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.0,0.0,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.0,0.0,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.0,0.0,0.01

In [424]:
games_data.dtypes

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [427]:
games_data.dropna().describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16291.000000,16291.000000,16291.000000,16291.000000,16291.000000,16291.000000,16291.000000
mean,8290.190228,2006.405561,0.265647,0.147731,0.078833,0.048426,0.540910
std,4792.654450,5.832412,0.822432,0.509303,0.311879,0.190083,1.567345
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4132.500000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8292.000000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12439.500000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.480000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [429]:
games_data.Global_Sales.mean()

0.5374406555006628

In [431]:
games_data.groupby("Genre")["Global_Sales"].sum() #the sum of global sales based on genre

Genre
Action          1751.18
Adventure        239.04
Fighting         448.91
Misc             809.96
Platform         831.37
Puzzle           244.95
Racing           732.04
Role-Playing     927.37
Shooter         1037.37
Simulation       392.20
Sports          1330.93
Strategy         175.12
Name: Global_Sales, dtype: float64

In [432]:
games_data.groupby("Genre")["Global_Sales"].describe()

               count      mean       std   min   25%    50%     75%    max
Genre
Action        3316.0  0.528100  1.156427  0.01  0.07  0.190  0.5000  21.40
Adventure     1286.0  0.185879  0.513280  0.01  0.02  0.060  0.1600  11.18
Fighting       848.0  0.529375  0.955965  0.01  0.08  0.210  0.5500  13.04
Misc          1739.0  0.465762  1.314886  0.01  0.06  0.160  0.4100  29.02
Platform       886.0  0.938341  2.585254  0.01  0.09  0.280  0.7900  40.24
Puzzle         582.0  0.420876  1.561716  0.01  0.04  0.110  0.3075  30.26
Racing        1249.0  0.586101  1.662437  0.01  0.07  0.190  0.5300  35.82
Role-Playing  1488.0  0.623233  1.707909  0.01  0.07  0.185  0.5225  31.37
Shooter       1310.0  0.791885  1.817263  0.01  0.08  0.230  0.7275  28.31
Simulation     867.0  0.452364  1.195255  0.01  0.05  0.160  0.4200  24.76
Sports        2346.0  0.567319  2.089716  0.01  0.09  0.220  0.5600  82.74
Strategy       681.0  0.257151  0.520908  0.01  0.04  0.090  0.2700   5.45

In [434]:
df=pd.DataFrame({"key":list("ABC")*2,
                 "data1":range(6),
                 "data2":np.arange(5,11)})
df

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [435]:
group=df.groupby("key")

**the .aggregate() method**:
The .aggregate() method, also known by its alias .agg(), is a powerful pandas function used to perform one or more aggregation operations on a DataFrame or Series. It is particularly useful after a groupby() operation to summarize data.

How It Works
The .agg() method takes a function, a list of functions, or a dictionary of functions and applies them to the specified data.

Single Function: Applies one aggregation function (e.g., 'sum', 'mean', 'count') to the entire DataFrame or a selected Series.

List of Functions: Applies multiple aggregation functions to the entire DataFrame or a selected Series, returning a new DataFrame with a column for each function.

Dictionary of Functions: This is the most flexible usage. It allows you to specify a different aggregation function for each column you want to summarize.

In [437]:
#to apply aggregate functions
group.aggregate("sum")

     data1  data2
key
A        3     13
B        5     15
C        7     17

In [441]:
group.aggregate(["min","median","max"])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     5    6.5   8
B       1    2.5   4     6    7.5   9
C       2    3.5   5     7    8.5  10

In [442]:
group.aggregate({"data1":"min","data2":"max"})

     data1  data2
key
A        0      8
B        1      9
C        2     10

In [443]:
def f(x):
    return x.max() - x.min()
group.agg(f)

     data1  data2
key
A        3      3
B        3      3
C        3      3

## Applying more than one function

In [444]:
data=pd.DataFrame({"letter":list("ABC")*4,
                   "num":["one","two"]*6,
                   "d1":np.random.randn(12),
                   "d2":np.arange(10,33,2)})
data

   letter  num        d1  d2
0       A  one  0.089786  10
1       B  two  0.167697  12
2       C  one -2.001759  14
3       A  two -0.638228  16
4       B  one  0.552171  18
5       C  two  0.449157  20
6       A  one  1.710047  22
7       B  two  0.223507  24
8       C  one -1.292065  26
9       A  two -1.688418  28
10      B  one  0.475164  30
11      C  two -0.042081  32

In [445]:
group=data.groupby(["letter","num"])

In [446]:
group.mean()

                  d1    d2
letter num
A      one  0.899916  16.0
       two -1.163323  22.0
B      one  0.513668  24.0
       two  0.195602  18.0
C      one -1.646912  20.0
       two  0.203538  26.0

In [447]:
group.agg(["mean","std"])

                  d1              d2
                mean       std  mean       std
letter num
A      one  0.899916  1.145698  16.0  8.485281
       two -1.163323  0.742596  22.0  8.485281
B      one  0.513668  0.054452  24.0  8.485281
       two  0.195602  0.039464  18.0  8.485281
C      one -1.646912  0.501829  20.0  8.485281
       two  0.203538  0.347357  26.0  8.485281

In [448]:
group.agg({"d1":["count","max","mean"],
           "d2":"sum"})

              d1                      d2
           count       max      mean sum
letter num
A      one     2  1.710047  0.899916  32
       two     2 -0.638228 -1.163323  44
B      one     2  0.552171  0.513668  48
       two     2  0.223507  0.195602  36
C      one     2 -1.292065 -1.646912  40
       two     2  0.449157  0.203538  52

In [449]:
data.groupby(["letter","num"],
             as_index=False).mean() #will not make the grouped columns as indeces

  letter  num        d1    d2
0      A  one  0.899916  16.0
1      A  two -1.163323  22.0
2      B  one  0.513668  24.0
3      B  two  0.195602  18.0
4      C  one -1.646912  20.0
5      C  two  0.203538  26.0

In [450]:
data.groupby(["letter","num"]).mean()

                  d1    d2
letter num
A      one  0.899916  16.0
       two -1.163323  22.0
B      one  0.513668  24.0
       two  0.195602  18.0
C      one -1.646912  20.0
       two  0.203538  26.0

## Split-Apply-Combine:

In [451]:
data

   letter  num        d1  d2
0       A  one  0.089786  10
1       B  two  0.167697  12
2       C  one -2.001759  14
3       A  two -0.638228  16
4       B  one  0.552171  18
5       C  two  0.449157  20
6       A  one  1.710047  22
7       B  two  0.223507  24
8       C  one -1.292065  26
9       A  two -1.688418  28
10      B  one  0.475164  30
11      C  two -0.042081  32

In [452]:
group=data.groupby("letter")

In [453]:
group["d2"].apply(lambda x:x.describe())

letter
A       count     4.000000
        mean     19.000000
        std       7.745967
        min      10.000000
        25%      14.500000
        50%      19.000000
        75%      23.500000
        max      28.000000
B       count     4.000000
        mean     21.000000
        std       7.745967
        min      12.000000
        25%      16.500000
        50%      21.000000
        75%      25.500000
        max      30.000000
C       count     4.000000
        mean     23.000000
        std       7.745967
        min      14.000000
        25%      18.500000
        50%      23.000000
        75%      27.500000
        max      32.000000
Name: d2, dtype: float64

In [454]:
data = pd.DataFrame({
    "Fruit": ["Apple", "Apple", "Banana", "Banana", "Orange", "Orange", "Apple"],
    "Store": ["A", "B", "A", "B", "A", "B", "A"],
    "Sales": [10, 15, 5, 7, 20, 25, 12]
})

print("Original Data:")
print(data)

Original Data:
    Fruit Store  Sales
0   Apple     A     10
1   Apple     B     15
2  Banana     A      5
3  Banana     B      7
4  Orange     A     20
5  Orange     B     25
6   Apple     A     12

In [456]:
result = data.groupby("Fruit")["Sales"].sum()
print(result)

Fruit
Apple     37
Banana    12
Orange    45
Name: Sales, dtype: int64

In [457]:
result = data.groupby(["Fruit", "Store"])["Sales"].mean()
print(result)

Fruit   Store
Apple   A        11.0
        B        15.0
Banana  A         5.0
        B         7.0
Orange  A        20.0
        B        25.0
Name: Sales, dtype: float64

In [458]:
result = data.groupby(["Fruit", "Store"])["Sales"].mean().reset_index()
print(result)

    Fruit Store  Sales
0   Apple     A   11.0
1   Apple     B   15.0
2  Banana     A    5.0
3  Banana     B    7.0
4  Orange     A   20.0
5  Orange     B   25.0

## Pivot Tables:

In [459]:
df=pd.DataFrame(
    {"class":list("ABC")*4,
     "lesson":["math","stat"]*6,
     "sex":list("MFMM")*3,
     "sibling":[1,2,3]*4,
     "score":np.arange(40,100,5)})
df

   class lesson sex  sibling  score
0      A   math   M        1     40
1      B   stat   F        2     45
2      C   math   M        3     50
3      A   stat   M        1     55
4      B   math   M        2     60
5      C   stat   F        3     65
6      A   math   M        1     70
7      B   stat   M        2     75
8      C   math   M        3     80
9      A   stat   F        1     85
10     B   math   M        2     90
11     C   stat   M        3     95

In [460]:
df.groupby("lesson")["score"].mean()

lesson
math    65.0
stat    70.0
Name: score, dtype: float64

In [462]:
df.groupby(
    ["lesson",
     "class"])[
    "score"].aggregate("mean")

lesson  class
math    A        55.0
        B        75.0
        C        65.0
stat    A        70.0
        B        60.0
        C        80.0
Name: score, dtype: float64

In [463]:
df.groupby(
    ["lesson",
     "class"])[
    "score"].aggregate("mean").unstack()

class      A     B     C
lesson
math    55.0  75.0  65.0
stat    70.0  60.0  80.0

In [464]:
df

   class lesson sex  sibling  score
0      A   math   M        1     40
1      B   stat   F        2     45
2      C   math   M        3     50
3      A   stat   M        1     55
4      B   math   M        2     60
5      C   stat   F        3     65
6      A   math   M        1     70
7      B   stat   M        2     75
8      C   math   M        3     80
9      A   stat   F        1     85
10     B   math   M        2     90
11     C   stat   M        3     95

In [465]:
df.pivot_table(
    "score",
    index="lesson",
    columns="class")

class      A     B     C
lesson
math    55.0  75.0  65.0
stat    70.0  60.0  80.0

In [466]:
df.pivot_table(
    ["sibling","score"],
    index=["class","lesson"],
    columns="sex")

             score       sibling
sex              F     M       F    M
class lesson
A     math     NaN  55.0     NaN  1.0
      stat    85.0  55.0     1.0  1.0
B     math     NaN  75.0     NaN  2.0
      stat    45.0  75.0     2.0  2.0
C     math     NaN  65.0     NaN  3.0
      stat    65.0  95.0     3.0  3.0

In [468]:
df.pivot_table(
    ["sibling","score"],
    index=["class","lesson"],
    columns="sex",margins=True)

             score                  sibling
sex              F          M   All       F    M  All
class lesson
A     math     NaN  55.000000  55.0     NaN  1.0  1.0
      stat    85.0  55.000000  70.0     1.0  1.0  1.0
B     math     NaN  75.000000  75.0     NaN  2.0  2.0
      stat    45.0  75.000000  60.0     2.0  2.0  2.0
C     math     NaN  65.000000  65.0     NaN  3.0  3.0
      stat    65.0  95.000000  80.0     3.0  3.0  3.0
All           65.0  68.333333  67.5     2.0  2.0  2.0

In [469]:
df.pivot_table(
    ["sibling","score"],
    index=["class","lesson"],
    columns="sex",fill_value=0)

             score       sibling
sex              F     M       F    M
class lesson
A     math     0.0  55.0     0.0  1.0
      stat    85.0  55.0     1.0  1.0
B     math     0.0  75.0     0.0  2.0
      stat    45.0  75.0     2.0  2.0
C     math     0.0  65.0     0.0  3.0
      stat    65.0  95.0     3.0  3.0

## Working with Text Data:

In [470]:
data=["tim","Kate","SUSan",np.nan,"aLEX"]

In [471]:
name=pd.Series(data)

In [472]:
name.str.capitalize()

0      Tim
1     Kate
2    Susan
3      NaN
4     Alex
dtype: object

In [473]:
name.str.lower()

0      tim
1     kate
2    susan
3      NaN
4     alex
dtype: object

In [474]:
name.str.len()

0    3.0
1    4.0
2    5.0
3    NaN
4    4.0
dtype: float64

In [475]:
name.str.startswith("a")

0    False
1    False
2    False
3      NaN
4     True
dtype: object

In [476]:
df=pd.DataFrame(
    np.random.randn(3,2),
    columns=["Column A","Column B"],
    index=range(3))
df

   Column A  Column B
0  0.051519  0.972851
1 -0.944613  1.263046
2 -1.017018 -1.305166

In [477]:
df.columns

Index(['Column A', 'Column B'], dtype='object')

In [478]:
df.columns.str.lower().str.replace(" ","_")

Index(['column_a', 'column_b'], dtype='object')

In [479]:
s=pd.Series(["a_b_c","c_d_e",np.nan,"f_g_h"])
s

0    a_b_c
1    c_d_e
2      NaN
3    f_g_h
dtype: object

In [480]:
s.str.split("_").str[1]

0      b
1      d
2    NaN
3      g
dtype: object

In [481]:
money=pd.Series(["15","-$20","$30000"])
money

0        15
1      -$20
2    $30000
dtype: object

In [482]:
money.str.replace("-\$","", regex=True)

0        15
1        20
2    $30000
dtype: object

In [483]:
film=pd.read_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\imdbratings.csv")

In [484]:
film.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [485]:
film.tail()

,star_rating,title,content_rating,genre,duration,actors_list
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [487]:
film.title.str.upper()

0                             THE SHAWSHANK REDEMPTION
1                                        THE GODFATHER
2                               THE GODFATHER: PART II
3                                      THE DARK KNIGHT
4                                         PULP FICTION
                            ...
974                                            TOOTSIE
975                        BACK TO THE FUTURE PART III
976    MASTER AND COMMANDER: THE FAR SIDE OF THE WORLD
977                                        POLTERGEIST
978                                        WALL STREET
Name: title, Length: 979, dtype: object

In [488]:
film.columns=film.columns.str.capitalize()

In [489]:
film.head()

,Star_rating,Title,Content_rating,Genre,Duration,Actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [490]:
film[film.Actors_list.str.contains(
    "Brad Pitt")]

,Star_rating,Title,Content_rating,Genre,Duration,Actors_list
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
24,8.7,Se7en,R,Drama,127,"[u'Morgan Freeman', u'Brad Pitt', u'Kevin Spac..."
106,8.3,Snatch.,R,Comedy,102,"[u'Jason Statham', u'Brad Pitt', u'Benicio Del..."
114,8.3,Inglourious Basterds,R,Adventure,153,"[u'Brad Pitt', u'Diane Kruger', u'Eli Roth']"
264,8.1,Twelve Monkeys,R,Mystery,129,"[u'Bruce Willis', u'Madeleine Stowe', u'Brad P..."
508,7.8,The Curious Case of Benjamin Button,PG-13,Drama,166,"[u'Brad Pitt', u'Cate Blanchett', u'Tilda Swin..."
577,7.8,Ocean's Eleven,PG-13,Crime,116,"[u'George Clooney', u'Brad Pitt', u'Julia Robe..."
683,7.7,Fury,R,Action,134,"[u'Brad Pitt', u'Shia LaBeouf', u'Logan Lerman']"
776,7.6,Moneyball,PG-13,Biography,133,"[u'Brad Pitt', u'Robin Wright', u'Jonah Hill']"
779,7.6,Interview with the Vampire: The Vampire Chroni...,R,Horror,123,"[u'Brad Pitt', u'Tom Cruise', u'Antonio Bander..."
807,7.6,The Assassination of Jesse James by the Coward...,R,Biography,160,"[u'Brad Pitt', u'Casey Affleck', u'Sam Shepard']"
826,7.5,Sleepers,R,Crime,147,"[u'Robert De Niro', u'Kevin Bacon', u'Brad Pitt']"
877,7.5,Legends of the Fall,R,Drama,133,"[u'Brad Pitt', u'Anthony Hopkins', u'Aidan Qui..."
901,7.5,Babel,R,Drama,143,"[u'Brad Pitt', u'Cate Blanchett', u'Gael Garc\..."

In [491]:
film.Actors_list.str.replace("[","")

0      u'Tim Robbins', u'Morgan Freeman', u'Bob Gunton']
1         u'Marlon Brando', u'Al Pacino', u'James Caan']
2      u'Al Pacino', u'Robert De Niro', u'Robert Duva...
3      u'Christian Bale', u'Heath Ledger', u'Aaron Ec...
4      u'John Travolta', u'Uma Thurman', u'Samuel L. ...
                             ...
974    u'Dustin Hoffman', u'Jessica Lange', u'Teri Ga...
975    u'Michael J. Fox', u'Christopher Lloyd', u'Mar...
976    u'Russell Crowe', u'Paul Bettany', u'Billy Boyd']
977    u'JoBeth Williams', u"Heather O'Rourke", u'Cra...
978    u'Charlie Sheen', u'Michael Douglas', u'Tamara...
Name: Actors_list, Length: 979, dtype: object

In [492]:
film.Actors_list.str.replace(
    "[","").str.replace("]","")

0       u'Tim Robbins', u'Morgan Freeman', u'Bob Gunton'
1          u'Marlon Brando', u'Al Pacino', u'James Caan'
2      u'Al Pacino', u'Robert De Niro', u'Robert Duvall'
3      u'Christian Bale', u'Heath Ledger', u'Aaron Ec...
4      u'John Travolta', u'Uma Thurman', u'Samuel L. ...
                             ...
974    u'Dustin Hoffman', u'Jessica Lange', u'Teri Garr'
975    u'Michael J. Fox', u'Christopher Lloyd', u'Mar...
976     u'Russell Crowe', u'Paul Bettany', u'Billy Boyd'
977    u'JoBeth Williams', u"Heather O'Rourke", u'Cra...
978    u'Charlie Sheen', u'Michael Douglas', u'Tamara...
Name: Actors_list, Length: 979, dtype: object

In [493]:
film.head()

,Star_rating,Title,Content_rating,Genre,Duration,Actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

## Multiple Selecting & Filtering in Pandas:

In [494]:
film=pd.read_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\imdbratings.csv")

In [495]:
film.head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [496]:
#selecting a certain column 
film["title"].head()

0    The Shawshank Redemption
1               The Godfather
2      The Godfather: Part II
3             The Dark Knight
4                Pulp Fiction
Name: title, dtype: object

In [497]:
#selecting multiple columns
film[["title","genre"]].head()

                      title   genre
0  The Shawshank Redemption   Crime
1             The Godfather   Crime
2    The Godfather: Part II   Crime
3           The Dark Knight  Action
4              Pulp Fiction   Crime

In [498]:
## loc method
film.loc[0,]

star_rating                                                     9.3
title                                      The Shawshank Redemption
content_rating                                                    R
genre                                                         Crime
duration                                                        142
actors_list       [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
Name: 0, dtype: object

In [499]:
film.loc[[0,2,4],]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [500]:
film.loc[0:2,]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [501]:
film.loc[0:5,"title"]

0    The Shawshank Redemption
1               The Godfather
2      The Godfather: Part II
3             The Dark Knight
4                Pulp Fiction
5                12 Angry Men
Name: title, dtype: object

In [502]:
film.loc[0:5,"title":"genre"]

                      title content_rating   genre
0  The Shawshank Redemption              R   Crime
1             The Godfather              R   Crime
2    The Godfather: Part II              R   Crime
3           The Dark Knight          PG-13  Action
4              Pulp Fiction              R   Crime
5              12 Angry Men      NOT RATED   Drama

In [503]:
film.loc[0:5,"title":"duration"]

                      title content_rating   genre  duration
0  The Shawshank Redemption              R   Crime       142
1             The Godfather              R   Crime       175
2    The Godfather: Part II              R   Crime       200
3           The Dark Knight          PG-13  Action       152
4              Pulp Fiction              R   Crime       154
5              12 Angry Men      NOT RATED   Drama        96

In [504]:
film.loc[:,"title":"genre"].head()

                      title content_rating   genre
0  The Shawshank Redemption              R   Crime
1             The Godfather              R   Crime
2    The Godfather: Part II              R   Crime
3           The Dark Knight          PG-13  Action
4              Pulp Fiction              R   Crime

In [505]:
film.loc[film.genre=="Crime",].head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [506]:
film.loc[film.genre=="Crime",[
    "title","duration"]]

                        title  duration
0    The Shawshank Redemption       142
1               The Godfather       175
2      The Godfather: Part II       200
4                Pulp Fiction       154
21                City of God       130
..                        ...       ...
927                     Brick       110
931              Mean Streets       112
950                     Bound       108
969       Law Abiding Citizen       109
978               Wall Street       126

[124 rows x 2 columns]

In [507]:
##iloc method
film.iloc[:,0].head()

0    9.3
1    9.2
2    9.1
3    9.0
4    8.9
Name: star_rating, dtype: float64

In [508]:
film.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [509]:
film.iloc[:,[0,3]].head()

   star_rating   genre
0          9.3   Crime
1          9.2   Crime
2          9.1   Crime
3          9.0  Action
4          8.9   Crime

In [510]:
film.iloc[:,0:3].head()

   star_rating                     title content_rating
0          9.3  The Shawshank Redemption              R
1          9.2             The Godfather              R
2          9.1    The Godfather: Part II              R
3          9.0           The Dark Knight          PG-13
4          8.9              Pulp Fiction              R

In [511]:
film.iloc[0:5,0:3]

   star_rating                     title content_rating
0          9.3  The Shawshank Redemption              R
1          9.2             The Godfather              R
2          9.1    The Godfather: Part II              R
3          9.0           The Dark Knight          PG-13
4          8.9              Pulp Fiction              R

In [512]:
film.iloc[0:5,].head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

 ## Multiple filtering:

In [513]:
film.loc[film.duration>=200,].head(3)

,star_rating,title,content_rating,genre,duration,actors_list
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
17,8.7,Seven Samurai,UNRATED,Drama,207,"[u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K..."

In [514]:
film.loc[film.duration>=200,"title"].head()

2                            The Godfather: Part II
7     The Lord of the Rings: The Return of the King
17                                    Seven Samurai
78                      Once Upon a Time in America
85                               Lawrence of Arabia
Name: title, dtype: object

In [517]:
film[(
    film.duration>=200)|(
    film.genre=="Drama")|(
    film.genre=="Action")].head(3)

,star_rating,title,content_rating,genre,duration,actors_list
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."

In [518]:
film[film.genre.isin([
    "Crime","Drama","Action"])]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
970,7.4,Wonder Boys,R,Drama,107,"[u'Michael Douglas', u'Tobey Maguire', u'Franc..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [521]:
crime_movies=film[film.genre=="Crime"]
crime_movies.title.to_csv(r"F:\studiess\Machine Learning and Artificial Intellignece\ML&AI_Coding_Academy\ML&AI_Repository\Python\Session7\Datasets\crime_movies.csv")